{
  "History of Vietnam": "Vietnam, with its coastal strip, rugged mountainous interior, and two major deltas, became home to numerous cultures throughout history. Its strategic geographical position in Southeast Asia also made it a crossroads of trade and a focal point of conflict, contributing to its complex and eventful past. The first Ancient East Eurasian hunter-gatherers arrived at least 40,000 years ago. Around 4,000 years ago during the Neolithic period, Southern East Asian populations, particularly Austroasiatic ",
  "Names of Vietnam": "Throughout the history of Vietnam, many names were used in reference to Vietnam.\n\nHistory\nThroughout the history of Vietnam, official and unofficial names have been used in reference to the territory of Vietnam. Vietnam was called Văn Lang during the Hồng Bàng dynasty, Âu Lạc under Thục dynasty, Nam Việt during the Triệu dynasty, Vạn Xuân during the Early Lý dynasty, Đại Cồ Việt during the Đinh dynasty and Early Lê dynasty. Starting in 1054, Vietnam was called Đại Việt (Great Việt). During the H",
  "Nine familial exterminations": "The nine familial exterminations, nine kinship exterminations, or execution of nine relations, also known by the names zuzhu (\"family execution\") and miezu (\"family extermination\"), was the most severe punishment for a capital offense in premodern China, Korea, and Vietnam. A collective form of kin punishment typically associated with offenses such as treason, the punishment involved the execution of all relatives of an individual, which were categorized into nine groups. The occurrence of this ",
  "Tusi": "Tusi, often translated as \"headmen\" or \"chieftains\", were hereditary tribal leaders recognized as imperial officials by the Yuan, Ming, and Qing dynasties of China, and the Later Lê and Nguyễn dynasties of Vietnam. They ruled certain ethnic minorities in central China, western China, southwestern China, and the Indochinese peninsula nominally on behalf of the central government. As succession to the Tusi position was hereditary, these regimes effectively formed numerous autonomous petty dynastie",
  "Việt gian": "Viet gian (Vietnamese: Việt gian; chữ Hán: 越奸) refers to a Vietnamese person who sells Vietnamese interests. It is similar to the Chinese term hanjian, meaning a Chinese traitor, and uses the same character for \"traitor\". This term has existed since the imperial era of Vietnam and was later used by both the North Vietnamese and South Vietnamese to refer to supporters of the other side.\n\nNorth Vietnam\nSince 1945, the Viet Minh have officially used it in legal documents to refer to the Vietnamese ",
  "Vietnamese National Heroes": "Vietnamese National Heroes (Vietnamese: Anh hùng dân tộc Việt Nam) is a term defined by the Ministry of Culture, Sports and Tourism to designate fourteen prominent figures in the history of Vietnam. These figures would have statues of them built in their home regions, regions where they had significant marks, regions where there are traditional events in their names, and regions that need tourist attractions.\n\nCriteria and List\nAccording to Official Dispatch 2296 (Công văn 2296/BVHTTDL-MTNATL), ",
  "Vietnamese nationalism": "Vietnamese nationalism (Vietnamese: chủ nghĩa dân tộc Việt Nam, or chủ nghĩa quốc gia Việt Nam) is a form of nationalism that asserts the Vietnamese people as a separate independent nation. It encompasses a broad range of ideas and sentiments harbored by the Vietnamese people in regards with national identity.\nSome modern nationalist concepts in Vietnam focused on China, where anti-Chinese sentiment in Vietnam had been fueled in various forms, from South China Sea disputes, to cultural and histo",
  "Vietnamese units of measurement": "Vietnamese units of measurement (Vietnamese: hệ đo lường Việt Nam) are the largely decimal units of measurement traditionally used in Vietnam until metrication. The base unit of length is the thước (chữ Nôm: 𡱩; lit. \"ruler\") or xích (chữ Hán: 尺). Some of the traditional unit names have been repurposed for metric units, such as thước for the metre, while other traditional names remain in translations of imperial units, such as dặm Anh (English \"dặm\") for the mile.\n\nHistory\nOriginally, many thước ",
  "Vietnamese era name": "Vietnamese era names were titles adopted in historical Vietnam for the purpose of year identification and numbering.\nEra names originated in 140 BCE in China, during the reign of the Emperor Wu of Han. Since the middle of the 6th century CE, independent Vietnamese dynasties started to proclaim their own era names.\nDuring periods of direct Chinese rule, Chinese era names would gain official use in Vietnam, as was the case for other parts of China.\n\nList of Vietnamese era names\nThe following is a ",
  "History of Vietnam (1945–present)": "After World War II and the collapse of Vietnam's monarchy, France attempted to re-establish its colonial rule but was ultimately defeated by the communist rebels in the First Indochina War. On the other hand, France granted complete independence to the pro-French Vietnamese government they established in 1949. The Geneva Accords in 1954 partitioned the country temporarily in two with a promise of democratic elections in 1956 to reunite the country. The United States and South Vietnam that did no",
  "2014 China–Vietnam border shootout": "On 18 April 2014, a group of sixteen Chinese citizens, later identified as ethnic Uyghurs, engaged in a shootout with Vietnamese border guards after seizing their guns as they were being detained to be returned to China. Five Uyghurs and two Vietnamese border guards died in the incident. Ten of the Uyghur perpetrators were men and the rest were women or children.\n\nShootout\nThe confrontation began after the guards detained a group of Uyghur illegal migrants inside a border post around noon, with ",
  "FULRO insurgency": "The United Front for the Liberation of Oppressed Races (French: Front unifié de lutte des races opprimées, abbreviated FULRO) waged a nearly three decade long insurgency against the governments of North and South Vietnam, and later the unified Socialist Republic of Vietnam. The FULRO insurgents represented the interests of indigenous Muslim and Hindu Cham, Montagnards, and Buddhist Khmer Krom against the ethnic Kinh Vietnamese. They were supported and equipped by China and Cambodia according to ",
  "Sino-Vietnamese conflicts (1979–1991)": "The Sino-Vietnamese conflicts of 1979–1991 were a series of border and naval clashes between the People's Republic of China and the Socialist Republic of Vietnam following the Sino-Vietnamese War in 1979. These clashes lasted from the end of the Sino-Vietnamese War until the normalization of ties in 1991.\nWhen the Chinese People's Liberation Army (PLA) withdrew from Vietnam in March 1979 after the war, China announced that they were not ambitious for \"any square inch of the territory of Vietnam\"",
  "Sino-Vietnamese War": "The Sino-Vietnamese War (also known by other names) was a brief conflict that occurred in early 1979 between China and Vietnam. China launched an offensive ostensibly in response to Vietnam's invasion and occupation of Cambodia in 1978, which ended the rule of the Chinese-backed Khmer Rouge. The conflict lasted for about a month, with China withdrawing its troops in March 1979.\nIn February 1979, Chinese forces launched a surprise invasion of northern Vietnam and quickly captured several cities n",
  "Vietnamese democracy movement": "The terms \"Vietnamese democracy movement\" and \"Vietnamese dissident movement\" comprise any of various isolated efforts to dissolve the current communist state and seek a liberal democracy for Vietnam after the fall of Saigon on 30 April 1975. There is not a major movement in Vietnam to reform the current political system. Opposition to governance has been characterised by sporadic calls for reform by minor groups and rare, small protests.\nVietnam was ranked 37th most electoral democratic country",
  "Vietnamese famine of 1944–1945": "The Vietnamese famine of 1944–45 (Vietnamese: Nạn đói Ất Dậu – famine of the Ất Dậu Year or Nạn đói năm 45 – the 1945 famine, due to most of the deaths occurring in 1945) was a famine that occurred in northern Vietnam in French Indochina during World War II from October 1944 to late 1945, which at the time was under Japanese occupation from 1940 with Vichy France as an ally of Nazi Germany in Western Europe. Between 400,000 and 2 million people are estimated to have starved to death during this ",
  "War in Vietnam (1954–1959)": "The 1954 to 1959 phase of the Vietnam War was the era of the two nations. Coming after the First Indochina War, this period resulted in the military defeat of the French, a 1954 Geneva meeting that partitioned Vietnam into North and South, and the French withdrawal from Vietnam (see First Indochina War), leaving the Republic of Vietnam regime fighting a communist insurgency with USA aid. During this period, North Vietnam recovered from the wounds of war, rebuilt nationally, and accrued to prepar",
  "War in Vietnam (1959–1963)": "The 1959 to 1963 phase of the Vietnam War started after the North Vietnamese had made a firm decision to commit to a military intervention in the guerrilla war in the South Vietnam, a buildup phase began, between the 1959 North Vietnamese decision and the Gulf of Tonkin Incident, which led to a major US escalation of its involvement. Vietnamese communists saw this as a second phase of their revolution, the US now substituting for the French.\nBetween the Geneva accords in 1954 and 1956, the two s",
  "An Dương Vương": "An Dương Vương (Vietnamese: [ʔaːn zɨəŋ vɨəŋ]), personal name Thục Phán, was the founding king and the only ruler of the kingdom of Âu Lạc, an ancient state centered in the Red River Delta. As the leader of the Âu Việt tribes, he defeated the last Hùng king of the state of Văn Lang and united its people – known as the Lạc Việt – with his people, the Âu Việt. An Dương Vương fled and committed suicide after the war with Nanyue forces in 179 BCE.\n\nBiography\nOrigin and foundation of Âu Lạc\nShu kingdo",
  "Âu Cơ": "Âu Cơ (chữ Hán: 甌姬; IPA: [əu˧ kəː˧]) was, according to the creation myth of the Vietnamese people, an immortal mountain snow goddess who married Lạc Long Quân (lit. 'Dragon Lord of Lạc'), and bore an egg sac that hatched a hundred children known collectively as Bách Việt, ancestors to the Vietnamese people. Âu Cơ is often honored as the mother of Vietnamese civilization.\n\nMythology\nÂu Cơ was a beautiful young tiên (immortal) who lived high in the snow-capped mountains. She traveled to help those",
  "Âu Việt": "The Âu Việt or Ouyue (Chinese: 甌越) were an ancient conglomeration of Baiyue tribes living in what is today the mountainous regions of northernmost Vietnam, western Guangdong, and northern Guangxi, China, since at least the third century BCE. They were believed to have belonged to the Tai-Kadai language group. In eastern China, the Ouyue established the Dong'ou or Eastern Ou kingdom. The Western Ou (西甌; pinyin: Xī Ōu; Tây meaning \"western\") were other Baiyue tribes, with short hair and tattoos, w",
  "Bắc Sơn culture": "The Bắc Sơn culture is the name given to a period of the Neolithic Age in Vietnam. The Bắc Sơn culture, also called the Bacsonian period, is often regarded as a variation of the Hoabinhian industry characterized by a higher frequency of edge-grounded cobble artifacts compared to earlier Hoabinhian artifacts.\n\n\n== References ==",
  "Cao Lỗ": "Cao Lỗ (高魯, also known as Cao Thông, Đô Lỗ, Thạch Thần, or Đại Than Đô Lỗ Thạch Thần) was a Vietnamese weaponry engineer and minister who lived during the reign of King An Dương Vương. According to mythology, he built a crossbow from the claw of a turtle god that can fire 300 arrows in a single shot.\n\nSee also\nÂu Lạc\nAn Dương Vương\nHồ Nguyên Trừng\nTrần Đại Nghĩa\n\nReferences\nBibliography\nKelley, Liam C. (2014). \"Constructing Local Narratives: Spirits, Dreams, and Prophecies in the Medieval Red Ri",
  "Cổ Loa Citadel": "Cổ Loa Citadel (Vietnamese: Thành Cổ Loa) is an important fortified settlement and archaeological site in present-day Hanoi's Đông Anh District, roughly 17 kilometers north of present-day Hanoi, in the upper plain north of the Red River. Various relics of the Bronze Age Phùng Nguyên culture and Đông Sơn culture have been found in Cổ Loa, although it was later established as the capital of Âu Lạc Kingdom during the 3rd century BCE (about 257 BCE). It might be the first political center of the Vie",
  "Đa Bút culture": "The Đa Bút culture (5000–1000 BCE) is the name given to a period of the early Neolithic Age in Vietnam, after the name of the site in Vĩnh Lộc district. The Đa Bút site was excavated in the 1930s by fr:Étienne Patte, and is a Neolithic cemetery distinguished by shell middens. The site has recently been carbon-dated to 5000 BC. The people at the site were hunter-gatherers, and fishermen, with evidence of farming both of livestock and paddy rice. Other studies have given the site a slightly later ",
  "Đồng Đậu culture": "The Đồng Đậu culture (c. 1,500-1,000 BC) was a culture of the Middle Bronze Age in Vietnam. The pottery of the Đồng Đậu culture is distinguished from Phùng Nguyên culture pottery by parallel markings.\n\nGallery\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\n\n== References ==",
  "Đông Sơn culture": "The Dong Son culture, Dongsonian culture, or the Lạc Việt culture (named for modern village Đông Sơn, a village in Thanh Hóa, Vietnam) was a Bronze Age culture in ancient Vietnam centred at the Red River Valley of northern Vietnam from 1000 BC until the first century AD.: 207  Vietnamese historians attribute the culture to the states of Văn Lang and Âu Lạc. Its influence spread to other parts of Southeast Asia, including Maritime Southeast Asia, from about 1000 BC to 1 BC.\nThe Dong Son people we",
  "Dong Son drum": "A Đông Sơn drum (Vietnamese: Trống đồng Đông Sơn, lit. 'Bronze drum of Đông Sơn'; also called Heger Type I drum) is a type of ancient bronze drum created by the Đông Sơn culture that existed in the Red River Delta. The drums were produced from about 600 BCE or earlier until the third century CE; they are one of the culture's most astounding examples of ancient metalworking. The drums, cast in bronze using the lost-wax casting method are up to a meter in height and weigh up to 100 kilograms (220 ",
  "Gò Mun culture": "The Gò Mun culture (c. 1,100-800 BC) was a culture of Bronze Age northern Vietnam.\nThe culture is known for pottery, weapons and many jade objects.\n\nGallery\n\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\t\t\n\t\t\t\n\t\t\t\n\t\t\n\n\n== References ==",
  "Hoabinhian": "The Hoabinhian is a lithic techno-complex of archaeological sites associated with assemblages in Southeast Asia from the late Pleistocene to the Holocene, dated to c. 10,000–2000 BCE. It is attributed to hunter-gatherer societies of the region whose technological variability over time is poorly understood. In 2016, a rock shelter was identified in Yunnan, China, 40 km from the border with Myanmar, where artifacts belonging to the Hoabinhian technocomplex were recognized, dating from 41,500 BCE.\n",
  "Hồng Bàng dynasty": "The Hồng Bàng period (Vietnamese: thời kỳ Hồng Bàng Vietnamese pronunciation: [tʰəːi˨˩ ki˨˩ hoŋm˨˩ baŋ˨˩]), also called the Hồng Bàng dynasty, was a legendary ancient period in Vietnamese historiography, spanning from the beginning of the rule of Kinh Dương Vương over the kingdom of Văn Lang (initially called Xích Quỷ) in 2879 BC until the conquest of the state by An Dương Vương in 258 BC. Vietnamese history textbooks claim that this state was established in the 7th century BC on the basis of th",
  "Hùng Duệ Vương": "Hùng Duệ Vương was the regnal name of kings in the eighteenth and last line or branch of the Hồng Bàng dynasty, which ruled from 408 BC to 258 BC.\n\nEarly life\nHùng Vương XVIII's birth date is unknown and he was Hùng Nghị Vương's son.\n\nTwo sons-in-law\nAccording to legend, Hùng Vương XVIII had at least three daughters, named Mỵ Nương Tiên Dung, Mỵ Nương Ngọc Hoa and Mỵ Nương Ngọc Nương. The eldest, Tiên Dung, refused to get married upon reaching the age of consent. One day, a dragon boat came to v",
  "Hùng king": "Hùng king (2879 BC – 258 BC; Chữ Hán: 雄王; Vietnamese: Hùng Vương (雄王) or vua Hùng (𤤰雄); Vương means \"king\" and vua means \"monarch; could mean emperor or king\") is the title given to the ancient Vietnamese rulers of the Hồng Bàng period.\n\nTraditional Vietnamese account\nEtymology\nIt is likely that the name Hùng Vương is a combination of the two Sino-Vietnamese words Hùng 雄 \"masculine, virile, fierce, powerful, grand\" and Vương 王, which means \"king\". The name Hùng Vương might have originally been a",
  "Kinh Dương Vương": "Kinh Dương Vương (chữ Hán: 涇陽王; \"King of Kinh Dương\") is a legendary ancient Vietnamese figure, mentioned in the 15th-century work Đại Việt sử ký toàn thư by having unified all the tribes within his territory into one state, and as the founder of the Hồng Bàng dynasty. He is considered the first sovereign of the Vietnamese people.\nAccording to the 15th-century Đại Việt sử ký toàn thư, he ruled over the state of Xích Quỷ (赤鬼國) starting in 2879 BC. Kinh Dương Vương's father was Đế Minh (帝明, \"Emper",
  "Lạc Việt": "The Lạc Việt or Luoyue (駱越 or 雒越; pinyin: Luòyuè ← Middle Chinese: *lɑk̚-ɦʉɐt̚ ← Old Chinese *râk-wat) were an ancient conglomeration of peoples inhabiting northern Vietnam, particularly the ancient Red River Delta, from approximately 700 BC to 100 AD, during the last stage of the Neolithic and the beginning of the period of classical antiquity. They spoke Kra-Dai and Austroasiatic languages. From archaeological perspectives, they were known as the Dongsonian. The Lạc Việt was known for casting ",
  "Li Lao drum": "The Li-Lao bronze drums or Heger type II drums are a type of ancient bronze drums found in Southern China and Northern Vietnam invented and used by Tai-Kadai-speaking (or specifically Tai-speaking) ethnic groups who were known to Chinese as Lǐ (俚) or Lǎo (獠) and who historically inhabited the area between the Red River Delta and the Pearl River Delta from the 3rd to 8th century AD and later the Muong people, an ethnic minority in Northern Vietnam, from the 10th to 12th century. Classified by Fra",
  "Mỹ Sơn": "Mỹ Sơn (Vietnamese pronunciation: [mǐˀ səːn]) is a cluster of abandoned and partially ruined Shaiva Hindu temples in central Vietnam, constructed between the 4th and the 13th century by the Kings of Champa, an Indianized kingdom of the Cham people. The temples are dedicated to the veneration of God in accordance with Shaivism, wherein God is named Shiva, or The Auspicious One. In this particular complex, he is venerated under various local names, the most important of which is Bhadreshvara.\nMỹ S",
  "Nanyue": "Nanyue (Chinese: 南越 or 南粵; pinyin: Nányuè; Jyutping: Naam4 Jyut6; lit. 'Southern Yue', Vietnamese: Nam Việt, Zhuang: Namz Yied), was an ancient kingdom founded in 204 BC by the Chinese general Zhao Tuo, whose family (known in Vietnamese as the Triệu dynasty) continued to rule until 111 BC. Nanyue's geographical expanse covered the modern Chinese subdivisions of Guangdong, Guangxi, Hainan, Hong Kong, Macau, southern Fujian and central to northern Vietnam. Zhao Tuo, then Commander of Nanhai Comman",
  "Óc Eo": "Óc Eo (Vietnamese) is an archaeological site in modern-day Óc Eo commune of Thoại Sơn District in An Giang Province of southern Vietnam. Located in the Mekong Delta, Óc Eo was a busy port of the kingdom of Funan between the 2nd century BC and 12th century AD and it may have been the port known to the Greeks and Romans as Cattigara.\nScholars use the term Óc Eo culture to refer to the archaeological culture of the Mekong Delta that is typified by the artifacts recovered at Óc Eo through archaeolog",
  "Phùng Nguyên culture": "The Phùng Nguyên culture of Vietnam (c. 2,000 – 1,500 BC) is a name given to a culture of the Bronze Age in Vietnam which takes its name from an archeological site in Phùng Nguyên, 18 km (11 mi) east of Việt Trì discovered in 1958. It was during this period that rice cultivation was introduced into the Red River region by northern Dai people. The first Phùng Nguyên culture excavation was in 1959, known as Co Nhue. The sites of Phùng Nguyên culture are usually several meters higher than the surro",
  "Lạc Long Quân": "Lạc Long Quân (\"Dragon King of Lạc\", also known as Sùng Lãm) is an ancient king of the Hồng Bàng dynasty of ancient Vietnam. Quân was the son of Kinh Dương Vương, the king of Xích Quỷ. He is the main figure in the Vietnamese myth of Lạc Long Quân - Âu Cơ.\nAccording to the myth, Lạc Long Quân married Âu Cơ, a mountain goddess. She gives birth to a sac containing 100 eggs from which 100 children were born; this is the origin of the Vietnamese people. One day Lạc Long Quân told Âu Cơ: \"I am descend",
  "Quduqian": "Quduqian (Vietnamese: Khuất-đô-can; Chinese: 屈都乾; pinyin: Qūdūqián) was the Chinese designation for an ancient kingdom, chiefdom, or a polity that perhaps located around Binh Dinh province, Central Vietnam, then became part of Champa Kingdoms. \nAccording to the Book of Jin, Quduqian situated 600 li or 186 miles/300 kilometers south of Boliao (波遼國, Tam Kỳ). Quduqian sent an embassy to the Jin court in Luoyang in 286 AD.\n\nSee also\nHistory of Champa\nOther early states in Central Vietnam\nLâm Ấp\nXitu",
  "Quỳnh Văn culture": "The Quỳnh Văn culture is the name given to a period of the Neolithic Age in Vietnam, after the name of the site in vi:Quỳnh Văn.\n\n\n== References ==",
  "Rinan": "Rinan (Chinese: 日南; pinyin: Rìnán; Vietnamese: Nhật Nam), also rendered as Jih-nan, was the southernmost commandery of the Chinese Han dynasty. It was located in the central area of modern-day Vietnam between Quảng Bình and Bình Định provinces. It was administered by a local mandarin under direction from the capital of Jiaozhi at Leilou or Longbian (after c. AD 200) near modern Hanoi. It was part of the territories briefly occupied by Trưng Trắc's rebellion forces in AD 39.\nThe concept of \"Rinan",
  "Sa Huỳnh culture": "The Sa Huỳnh culture was a culture in what is now central and southern Vietnam that flourished between 1000 BC and 200 AD. Archaeological sites from the culture have been discovered from the Mekong Delta to Quảng Bình province in central Vietnam. The Sa Huynh people were most likely the predecessors of the Cham people, an Austronesian-speaking people and the founders of the kingdom of Champa.: 211–217\n\nDescription\nThe site at Sa Huỳnh was discovered in 1909. Sa Huỳnh sites were rich in locally w",
  "Sơn Vi culture": "The Sơn Vi culture is the name given to a culture of the late Palaeolithic and early Mesolithic Age in Vietnam.\nSơn Vi (vi) itself is a village (xã) in Lâm Thao District, Phú Thọ Province. Sơn Vi is the official Chinese character tên chữ name of the village, it also has a demotic Vietnamese tên nôm name, kẻ Vây.\n\n\n== References ==",
  "Triệu dynasty": "The Triệu dynasty or Zhao dynasty (Chinese: 趙朝; lit. 'Zhao dynasty'; Vietnamese: Nhà Triệu; 茹趙) ruled the kingdom of Nanyue, which consisted of parts of southern China as well as northern Vietnam. Its capital was Panyu, in modern Guangzhou. The founder of the dynasty, Zhao Tuo (Triệu Đà), was a Chinese general from Hebei and originally served as a military governor under the Qin dynasty. He asserted the state's independence in 207 BC as the Qin dynasty was collapsing. The ruling elite included b",
  "Xitu": "Xitu (Vietnamese: Tây-đồ-quốc; Chinese: 西屠國; pinyin: Xītú Guó; lit. 'Kingdom of Xitu') was the Chinese designation for a historical region or a Chamic polity or kingdom that was first mentioned in the mid of fifth century AD, is believed to be one of the predecessors of Champa Kingdom. It has been proposed to be located in the Thu Bồn River Valley, present-day Quảng Nam Province, Central Vietnam.\n\nBackground\nThe Thu Bồn River Valley was known for being one of many sanctuary zones of the Sa Huỳnh",
  "Baiyue": "The Baiyue, Hundred Yue, or simply Yue, were various ethnic groups who inhabited the regions of southern China and northern Vietnam during the 1st millennium BC and 1st millennium AD. They were known for their short hair, body tattoos, fine swords, and naval prowess.\nDuring the Warring States period, the word \"Yue\" referred to the state of Yue in Zhejiang. The later kingdoms of Minyue in Fujian and Nanyue in Guangdong were both considered Yue states. During the Zhou and Han dynasties, the Yue li",
  "Homo erectus": "Homo erectus ( lit. 'upright man') is an extinct species of archaic human from the Pleistocene, spanning nearly 2 million years. It is the first human species to evolve a humanlike body plan and gait, to leave Africa and colonize Asia and Europe, and to wield fire. H. erectus is the ancestor of later human species, including H. heidelbergensis — the last common ancestor of modern humans, Neanderthals, and Denisovans. As such a widely distributed species both geographically and temporally, H. ere",
  "Pongo hooijeri": "Pongo hooijeri is an extinct species of orangutan from the Pleistocene of Vietnam.  It was named in honor of paleontologist Dirk Albert Hooijer. Fossils of the ape were found in the Tham Hai Cave.\n\nDescription\nPongo hooijeri is only known from isolated teeth. In its initial description, it was distinguished from other orangutan species by its generally larger tooth size than living orangutans, as well as a number of morphological characters of the teeth, differing from Pongo pygmaeus \"in lacking",
  "List of years in Vietnam": "This is a list of years in Vietnam.\n\nBefore 20th century\n20th century\n21st century\nSee also\nTimeline of Vietnam under Chinese rule\nTimeline of early independent Vietnam\nTimeline of the Lý dynasty",
  "Timeline of Vietnamese history": "This is a timeline of Vietnamese history, comprising important legal and territorial changes and political events in Vietnam and its predecessor states. To read about the background to these events, see History of Vietnam.\n\nPrehistoric Vietnam\n30th century BC\n29th century BC\n28th century BC\n27th century BC\n26th century BC\n25th century BC\n24th century BC\n23rd century BC\n22nd century BC\n21st century BC\n20th century BC\n19th century BC\n17th century BC\n16th century BC\n15th century BC\n14th century BC\n",
  "Art of Champa": "Champa was an Southeast Asian civilization that flourished along the coasts of what is now central and southern Vietnam for roughly a one thousand-year period between 500 and 1700 AD. The original Cham and Proto-Chamic peoples were mainland Austronesian sailors, who adopted as their principal vocations those of trade, shipping, and piracy. Their cities were ports of call on important trade routes linking India, China and the Indonesian islands. The history of Champa was one of intermittent confl",
  "Four Great Treasures of Annam": "The Four Great Treasures of Annam (Vietnamese: An Nam tứ đại khí, chữ Hán: 安南四大器), were four bronzes of the cultures of Lý and Trần dynasties of Vietnam: the Báo Thiên Pagoda, the Quy Điền Bell, the Buddha Statues of Quỳnh Lâm Temple and the Phổ Minh Caldron. None of these artifacts survived.\n\nBáo Thiên Pagoda\nState historical documents record construction of a 12 or 13 level tower in 1057 with 12,000 Vietnamese pound (7,250kg) of bronze being used to create a bell. The top of pagoda where doors",
  "Vietnamese nobility": "During Vietnam's monarchial period, the Vietnamese nobility (quý tộc) were classified into eleven ranks (tước vị), with names similar to their Chinese equivalent. These are listed here from the highest to the lowest, along with their equivalent European titles.\n\nTerminology\nSovereigns\nSovereign rulers (both Emperors and Kings) in general are referred to in Vietnamese as Vua (𤤰).  This term, which can also be interpreted as \"Patron\", has no equivalent in Chinese languages, but comes from the indi",
  "Vietnamization (cultural assimilation)": "Vietnamization or Vietnamisation (Vietnamese: Việt hóa, chữ Hán: 越化 or Vietnamese: Việt Nam hóa, chữ Hán: 越南化) is the acquisition or imposition of elements of Vietnamese culture, in particular the Vietnamese language and customs. This was experienced in some historic periods by the non-Vietnamese populations of territories controlled or substantially under the influence of Vietnam. As with other examples of cultural assimilation, it is partly voluntary and partly forced and most visible in terri",
  "Economic history of Vietnam": "Until French colonization in the middle of the 19th century, the economy of Vietnam was mainly agrarian and village-oriented.  However, French colonizers deliberately developed the regions differently, designating the South for agricultural production and the North for manufacturing. Though the plan exaggerated regional divisions, the development of exports--coal from the North, rice from the South—and the importation of French manufactured goods stimulated internal commerce.\nWhen the North and ",
  "Bảo Đại Thông Bảo": "The Bảo Đại Thông Bảo (chữ Hán: 保大通寶; French: Sapèque Bao-Daï) was a round Copper-alloy coin with a square hole produced by the Nguyễn dynasty under French protection and was the last cash coin produced both in Vietnam and the world, this ended a long series of cast Vietnamese coinage that started with the Thái Bình Hưng Bảo in 970. The cast Bảo Đại Thông Bảo were produced at the Thanh Hóa Mint, while the machine-struck variants were produced in Hanoi by the colonial French government. These coi",
  "Cochinchina piastre": "Between 1878 and 1885, the Cochinchina piastre was the currency of the French colony of Cochinchina. It was replaced by the French Indochinese piastre after the creation of a unified administration for Cochinchina and the other French protectorates and colonies in the Far East (Annam, Cambodia and Tonkin) on 22  December 1885.\n\nHistory\nBackground\nIn the year 1868 the price for a lunch at a restaurant in rue Catinat in Saigon (present day Đồng Khởi Street in Ho Chi Minh City) cost one piastre whi",
  "Đổi Mới": "Đổi Mới (IPA: [ɗo᷉i mə̌ːi]; transl. \"renovation\" or \"innovation\") is the name given to the economic reforms initiated in Vietnam in 1986 with the goal of creating a \"socialist-oriented market economy\". The term đổi mới itself is a general term with wide use in the Vietnamese language meaning \"innovate\" or \"renovate\". However, the Đổi Mới Policy (Chính sách Đổi Mới) refers specifically to these reforms that sought to transition Vietnam from a command economy to a socialist-oriented market economy",
  "South Vietnamese đồng": "The đồng (銅), also called the piastre, was the currency of South Vietnam from 1953 to 2 May 1978. It was subdivided into 100 xu, also written su.\n\nFirst đồng, 1953 to 1975\nHistory\nIn 1953, the Vietnam branch of the Institut d'Émission des États du Cambodge, du Laos et du Viet-nam issued notes dual denominated in piastre and đồng. At the same time, the two other branches of the Bank made similar issues with the riel in Cambodia and the kip in Laos. The đồng circulated in those parts of Vietnam no",
  "North Vietnamese đồng": "The đồng (Chữ Nôm: 銅; Chữ Hán: 元, nguyên) (; Vietnamese: [ɗôŋm]) was the currency of North Vietnam from 3 November 1946 to 2 May 1978. It was subdivided into 10 hào, each itself divided into 10 xu.\n\nHistory\nThe first đồng issued by the communists controlling northern Vietnam was introduced on January 31, 1946, and replaced the French Indochinese piastre at par. Two revaluations followed. In 1951, the second đồng was introduced at a rate of 1 1951 đồng = 100 1946 đồng. However, some sources say t",
  "Economy of the Nguyễn dynasty until 1884": "The economy of the nineteenth-century period of the Nguyễn dynasty was primarily agricultural. Ninety-five percent of the national economy depended on agriculture. Fragile Mining and handicraft were the only industry sectors in the country before the 1870s. International trade and business were heavily restricted by the Confucian-minded bureaucratic state. Contact with the outside world and modernisation efforts were kept constraining.\n\nAgriculture\nRice was the most important grain. Rich peasant",
  "Economy of the Republic of Vietnam": "The Republic of Vietnam (South Vietnam) had an open market economy mostly based on services, agriculture, and aid from the United States. Though formally a free market economy, economic development was based largely on five-year economic plans or four-year economic plans. Its economy stayed stable in the 10 first years, then it faced difficulties due to the escalation of the Vietnam War, which led to unsteady economic growth, high state budget deficits, high inflation, and trade deficits. The So",
  "Five-Year Plans of Vietnam": "The Five-Year Plans of Vietnam are a series of economic development initiatives. The Vietnamese economy is shaped primarily by the Vietnamese Communist Party through the plenary sessions of the Central Committee and national congresses. The party plays a leading role in establishing the foundations and principles of communism, mapping strategies for economic development, setting growth targets, and launching reforms.\nPlanning is a key characteristic of centralized, planned economy, and one plan ",
  "French Indochinese piastre": "The piastre de commerce (\"trade piastre\") was the currency of French Indochina between 1887 and 1954. It was first used in 1885. It was subdivided into 100 cents, each of 2~6 sapèques.\nThe name piastre (French pronunciation: [pjastʁ]), from Spanish pieces of eight (pesos), dates to the 16th century and has been used as the name of many different historical units of currency.\n\nDenominations\nThe currency of French Indochina was divided into the piastre, cent / centime, and sapèque units. One piast",
  "Khải Định Thông Bảo": "The Khải Định Thông Bảo (chữ Hán: 啓定通寳; French: Sapèque Khaï-Dinh) was a French Indochinese sapèque coin produced from 1921 until 1933, the design of the coin was round with a square hole that was used for stringing them together. Khải Định became Emperor of Annam in 1916 the funding for the production of new cash coins was reduced by the Hanoi Mint which lead to the demand of the Vietnamese market for low value denominations to not be met, furthermore, after Hanoi reduced funding for the Thanh ",
  "Land reform in Vietnam": "Land reform in Vietnam began in the political turmoil following World War II in which a civil war pitted the communist Viet Minh against the French colonists and their supporters. At that time a large percentage of agricultural land was owned by large landowners and the majority of the rural population of Vietnam owned only small plots of land or was landless. The early success of the land reform program of the Viet Minh (and their successors, the Viet Cong), gave the communists a strong base of",
  "Land reform in North Vietnam": "Land reform in North Vietnam (Vietnamese: Cải cách ruộng đất tại miền Bắc Việt Nam) can be understood as an agrarian reform in northern Vietnam throughout different periods, but in many cases it only refers to the one within the government of Democratic Republic of Vietnam (DRV) in the 1950s. The reform was one of the most important economic and political programs launched by the Viet Minh government during the years 1953–1956.\n\nBackground\nThe project of land reform in North Vietnam was a produc",
  "Thái Bình Hưng Bảo": "The Thái Bình Hưng Bảo (chữ Hán: 太平興寶) was the first cash coin produced in Vietnam as well as the oldest currency ever natively produced there. Despite bearing the actual legend of Đại Bình Hưng Bảo (大平興寶) it is known as the \"Thái Bình Hưng Bảo\" because the era name was \"Thái Bình\" (太平) as it was first minted in 970 under the reign of Ðinh Tiên Hoàng of the Đinh dynasty, its production ran until 979 under his son, Đinh Phế Đế. The Thái Bình Hưng Bảo was the only coin produced under the Đinh dyna",
  "Tự Đức Bảo Sao": "The Tự Đức Bảo Sao (chữ Hán: 嗣德寶鈔) was a series of large denomination Vietnamese cash coins produced under the reign of Emperor Tự Đức from 1861 to complement the contemporary Tự Đức Thông Bảo (嗣德通寶) copper and zinc cash coins with larger nominal values. These coins were very badly received by the general population as their intrinsic value was relatively low compared to their nominal value and for this reason the Vietnamese government reduced the value of a single Tiền to 50 văn and allowed the",
  "Tự Đức Thông Bảo": "Tự Đức Thông Bảo (chữ Hán: 嗣德通寶) was an inscription used on different coins made from various metals and alloys during the reign of Emperor Tự Đức. The coinage of Tự Đức saw the introduction of the term văn (文) which was an accounting unit used for copper-alloy cash coins denominating their worth in number of zinc cash coins with a weight of 6 phần.\nThese coins circulated alongside another series of issued under Emperor Tự Đức, the Tự Đức Bảo Sao.\n\nHistory\nThe sapèqueries of Đại Nam under Empero",
  "Vietnamese cash": "The Vietnamese cash (chữ Hán: 文錢 văn tiền; chữ Nôm: 銅錢 đồng tiền; French: sapèque), also called the sapek or sapèque, is a cast round coin with a square hole that was an official currency of Vietnam from the Đinh dynasty in 970 until the Nguyễn dynasty in 1945, and remained in circulation in North Vietnam until 1948. The same type of currency circulated in China, Japan, Korea, and Ryūkyū for centuries. Though the majority of Vietnamese cash coins throughout history were copper coins, lead, iron ",
  "Vietnamese mạch": "The mạch (chữ Hán: 陌) was a Vietnamese currency unit introduced in 1837 during the Nguyễn dynasty, the mạch represented a value of 60 văn (文, or 60 zinc cash coins) and was itself 1⁄10 of the quán (貫).\nThe mạch currency unit was used on both copper-alloy cash coins and silver ingots, the only series of cash coins to use the character \"mạch\" (陌) in its inscription was the Tự Đức Bảo Sao (嗣德寶鈔) cash coins, but had been previously used as a denomination (by imperial decree) for larger cash coins un",
  "Vietnamese văn (currency unit)": "The Vietnamese văn (chữ Hán: 文; French: Sapèque) as a denomination for Vietnamese cash coins was used from 1868 until 1945 during the reign of the Nguyễn dynasty. The inspiration to introduce the văn may have been to emulate the Chinese wén used on contemporary Qing dynasty cash coins which had just become a fiat currency, however unlike the Chinese system where all Chinese cash coins were cast from the same metals and the wén was the primary unit of account for coins made of the same metals, th",
  "Zu Yong Diao": "Zu Yong Diao was a way of taxation of Tang dynasty China, pre-modern Japan, Korea and Vietnam. It was established in the seventh year of Wude. The Zuyongdiao consists of Zu (租), the tax paid in grains, Yong (庸) that was paid in corvee and Diao (調) which was paid in textiles.\n\nIn China\nZuyongdiao was paired with the policy of land equalization and was effective according to the later policy. The land equalization provides equally divided grain fields to farmers. Every farmer will pay a fixed amou",
  "Zhuangyuan": "Zhuangyuan, or trạng nguyên in Vietnamese, variously translated into English as principal graduate, primus, or optimus, was the title given to the scholar who achieved the highest score on highest level of the Imperial examination, Metropolitan examination (in the Tang dynasty) and Palace examination (in the Song dynasty) in ancient China and Vietnam.\nIn China, Fu Shanxiang is known as the first (and last) female zhuangyuan (nü zhuangyuan) in Chinese history, but under the Taiping Heavenly Kingd",
  "Đàng Ngoài": "Đàng Ngoài  (chữ Hán: 唐外, lit. \"Outer Land\"), also known as Tonkin, Bắc Hà (北河, \"North of the River\") or  Kingdom of Annam (安南國) by foreigners, was an area in northern Đại Việt (now Vietnam) during the 17th and 18th centuries as the result of Trịnh–Nguyễn War. The word \"Đàng Ngoài\" first appeared in the Dictionarium Annamiticum Lusitanum et Latinum by Alexandre de Rhodes.\nĐàng Ngoài was de-facto ruled by the Trịnh lords with the Lê emperors acting as titular rulers. The capital was Thăng Long (n",
  "Đàng Trong": "Đàng Trong (chữ Nôm: 唐冲, lit. \"Inner Circuit\"), also known as Nam Hà (chữ Hán: 南河, \"South of the River\"), was the South region of Vietnam, under the lordship of the Nguyễn clan, later enlarged by the Vietnamese southward expansion. The word Đàng Trong first appeared in the Dictionarium Annamiticum Lusitanum et Latinum by Alexandre de Rhodes. Contemporary European sources called it Cochinchina or Quinam.\nDuring the 17th century and almost all the 18th century, Đàng Trong was a de facto independen",
  "Fu (administrative division)": "Fu (Chinese: 府; pinyin: ) is a traditional administrative division of Chinese origin used in the East Asian cultural sphere, translated variously as commandery, prefecture, urban prefecture, or city. They were first instituted as a regular form of administrative division of China's Tang Empire, but were later adopted in Vietnam, Japan and Korea. At present, only two fu still remain: the prefectures of Kyoto and Osaka in Japan.\nThe term fu is currently also used in Chinese to translate the provin",
  "Jiaozhi": "Jiaozhi (standard Chinese, pinyin: Jiāozhǐ), or \nVietnamese: Giao Chỉ, \nwas a historical region ruled by various Chinese dynasties, corresponding to present-day northern Vietnam. The kingdom of Nanyue (204–111 BC) set up the Jiaozhi Commandery (Chinese: 交趾郡, 交阯郡; Vietnamese: Quận Giao Chỉ, chữ Hán: 郡交趾) an administrative division centered in the Red River Delta that existed through Vietnam's first and second periods of Chinese rule. During the Han dynasty, the commandery was part of a province o",
  "Jiaozhou (region)": "Jiaozhou (Chinese: 交州; Wade–Giles: Chiao1-Cho1; Vietnamese: Giao Châu) was an imperial Chinese province under the Han and Jin dynasties. Under the Han, the area included Liangguang and northern Vietnam but Guangdong was later separated to form the province of Guangzhou by Sun Quan following the death of Shi Xie and lasted until the creation of the  Annan Protectorate in 679.\n\nHistory\nHan dynasty\nIn 111 BC, the armies of Emperor Wu conquered the rebel state of Nanyue and organized the area as the",
  "Six Provinces of Southern Vietnam": "The Six Provinces of Southern Vietnam (Vietnamese: Nam Kỳ Lục tỉnh, 南圻六省 or just Lục tỉnh, 六省) is a historical name for the region of Southern Vietnam, which is referred to in French as Basse-Cochinchine (Lower Cochinchina). The region was politically defined and established after the inauguration of the Nguyễn dynasty, and called by this name from 1832, when Emperor Minh Mạng introduced administrative reforms.\nThe six provinces, which in 1832 Emperor Minh Mạng divided Southern Vietnam into, are",
  "Tượng Lâm": "Tượng Lâm (Vietnamese chữ Hán pronunciation of Chinese: 象林 Xianglin) was an area in what is today the central Vietnam modern-day Thừa Thiên Huế province which rebelled against the Han dynasty’s rule during the second Chinese domination of Vietnam around 192 AD and established the first independent Champa kingdom. The king was Sri Mara, son of Xianglin County's Officer of Merit.\n\n\n== References ==",
  "Military history of Vietnam": "Army and warfare made their first appearance in Vietnamese history during the 3rd millennium BC. Throughout thousands of years, wars played a great role in shaping the identity and culture of people inhabited the land which is modern day Vietnam.\n\nHồng Bàng period\nWeapons are the most common Bronze Age artifacts found so far. The presence of arms in many tombs of upper-class people indicates the existence of a warrior class in Đông Sơn society during the Hồng Bàng dynasty.\n\nMedieval period\nWarfa",
  "Citadel of Biên Hòa": "Citadel of Biên Hòa (Vietnamese: Thành cổ Biên Hòa) is a historic site located in Quang Vinh ward, Biên Hòa, Đồng Nai. It is considered the only ancient citadel in the Southern Vietnam that still exists today.\nThe remains of the old citadel is a laterite wall surrounding a 10,816.5 m2 wide campus.  Inside the citadel, there is a French architecture manson.\n\nHistory\nThe land of former Biên Hòa had had an older citadel built by the Chenla people. In 1834, Emperor Minh Mang ordered to rebuild that ",
  "Artillery of the Nguyễn lords": "The artillery of the Nguyễn lords, the family that ruled southern Vietnam from the late 16th to the late 18th centuries, and the precursor of the Nguyễn dynasty, was an important component of their military success in repelling attacks from the rival Trịnh lords, their northern contemporaries. Between 1627 and 1672, seven campaigns were waged by the Trịnh in an attempt to break the Nguyễn, without success, along a front line near the 17th parallel, which later divided North and South Vietnam, fr",
  "Bãi Sậy uprising": "The Bãi Sậy revolt (1885-1889, Khởi nghĩa Bãi Sậy) was an anti-French revolt led by Nguyễn Thiện Thuật (alias Tán Thuật). It takes its name from the swampy Bãi Sậy \"Field of Reeds\" area in Văn Giang and Khoái Châu districts, Hưng Yên province.\nApart from Nguyễn Thiện Thuật, the other leaders were vi:Nguyễn Thiện Kế, Nguyễn Thiện Dương, Nguyễn Thiện Tuyển, Nguyễn Thiện Thường, vi:Đốc Tít, vi:Tạ Hiện and vi:Nguyễn Cao.\n\n\n== References ==",
  "Laurent André Barisy": "Laurent-André-Estiennet-Marie Barisy (also spelled Barizy; 8 November 1769 – 23 July 1802) was an adventurer who went into the service of Nguyễn Ánh, the future emperor Gia Long of Nguyễn dynasty, Vietnam. \nLaurent Barisy was born in Port Louis, Isle de France (mordern Mauritius). He was originally from Groix, Brittany, France. Official documents were silent on his nationality.: 105  Some scholars thought he was an English person.: 110 \nBarisy was a friend of Olivier de Puymanel. He entered Nguy",
  "Jean-Baptiste Cécille": "Jean-Baptiste Thomas Médée Cécille (French pronunciation: [ʒɑ̃ batist tɔmɑ mede sesil]; 16 October 1787, Rouen – 9 November 1873) was a French Admiral and politician who played an important role in the French intervention of Vietnam. He also circumnavigated the globe.\n\nMilitary career\nIn 1837–1839, Cécille circumnavigated the world as the commander of the corvette Héroïne. He left Brest on 1 July 1837 with the objective of protecting French whaling ships. He contributed to the survey of New Zeal",
  "Jean-Baptiste Chaigneau": "Jean-Baptiste Chaigneau (1769–1832) was a French Navy sailor and an adventurer who played an important role in Vietnam in the 19th century. He served the Nguyễn dynasty from 1794 to 1819, and 1821 to 1826, and took the Vietnamese name of Nguyễn Văn Thắng (阮文勝).\n\nRole in Vietnam\nJean-Baptiste Chaigneau was among the soldiers who were gathered by Father Pierre Pigneau de Behaine to support the efforts of Nguyễn Phúc Ánh to conquer Vietnam. He came to Vietnam with Pigneau in 1794. Chaigneau support",
  "Châu Văn Tiếp": "Châu Văn Tiếp (朱文接, 1738–1784), born Châu Doãn Ngạnh (朱尹梗), was an 18th-century Vietnamese military commander, best known for his role as a general of Nguyễn Ánh.\n\nEarly life\nBorn in 1738, Châu Văn Tiếp was a son of a horse merchant from Phú Yên, on the southern coast of Vietnam. When Tiep was young, he mastered the martial arts and could speak both Siamese and Khmer.\n\nMilitary career\nIn 1773, the Tây Sơn brothers revolted, so Châu Văn Tiếp and his family went into hiding in Hà Duy, remote mount",
  "Copper columns of Ma Yuan": "Copper columns of Ma Yuan (Vietnamese: Cột đồng Mã Viện) were a pair of copper columns erected by General Ma Yuan of Han China after his suppression of the Trung sisters' rebellion in 43 CE. The columns stood at southern frontier of Tượng Lâm (Xianglin) to mark the boundary of Chinese territory against those the considered the barbarians. Ma prayed to the heaven: \"If the copper columns break, Jiaozhi will be destroyed.\" (In Chinese, 銅柱折交趾滅, Tóng zhù zhé jiāozhǐ miè.) The location of the columns ",
  "Đống Đa Mound": "Đống Đa Mound (Vietnamese: Gò Đống Đa) or Đống Đa Hill is a historic tumulus-like mound in the Đống Đa Park (Công viên Đống Đa), in the Đống Đa District, Hanoi, Vietnam.\n\nBackground\nĐống Đa Mound is said to be the place where the Battle of Ngọc Hồi-Đống Đa between Tây-Sơn and the Manchu Qing army ended. \nHaving lost, Sầm Nghi Đống (Chinese: 岑宜棟) fled and refused to fall into the hands of the Tây-Sơn by hanging himself on Ốc (Loa Sơn) hill. After the war, in order to promote diplomatic relations ",
  "Jacques Duchesne": "General Jacques Charles René Achille Duchesne (3 March 1837 – 27 April 1918) was a 19th-century French military officer. He was born at Sens and entered Saint-Cyr in 1855, aged 18, and became a lieutenant in 1861.\n\nCareer\nDuchesne fought in the Franco-Prussian War in 1870–1871. He became a lieutenant-colonel in 1881.\n\nTonkin and Formosa\nIn 1884-85, during the Sino-French War, Lieutenant-Colonel Duchesne distinguished himself both in Tonkin (northern Vietnam) and Formosa (now Taiwan). On 12 March",
  "Hanoi Poison Plot": "The Poisoning at Hanoi Citadel (Vietnamese: Hà Thành đầu độc; Chữ Hán: 河城投毒) was a poisoning plot which occurred in 1908 when a group of Vietnamese indigenous tirailleurs attempted to poison the entire French colonial army's garrison in the Citadel of Hanoi. The aim of the plot was to neutralize the French garrison and make way for Hoang Hoa Tham's rebel army to capture Hanoi. The plot was disclosed, and then was suppressed by the French.\n\nBackground and poisoning\nIn early 1908, Hoang Hoa Tham c",
  "History of Vietnamese military ranks": "The system of Vietnamese military ranks was originally introduced on 22 March 1946 by President Ho Chi Minh, originally based on the military ranks system of Japanese military. Reference designs to the military ranks system of the French military. In 1958, the Vietnam People's Army military ranks system was changed, and has no Marshal or General of the Army or Brigadier General. In contrast, the Colonel General, Senior Colonel or Senior Lieutenant in Vietnam at present do not exist in many count",
  "Ja Thak Wa uprising": "Ja Thak Wa uprising (Vietnamese: Khởi nghĩa Ja Thak Wa) was a revolt led by two ethnic Cham leaders, Ja Thak Wa and Po War Palei, against the Vietnamese government under Emperor Minh Mạng in 19th century southern Vietnam.\nNorthern Champa was conquered by the Dai Viet in 1471 but the Cham kept various forms of autonomy until 1832 (Panduranga and Principality of Thuận Thành). The Chams were forced to adopt Vietnamese customs.\nAfter the Katip Sumat uprising was put down, Ja Thak Wa (Thầy Điền or Đi",
  "Katip Sumat uprising": "Katip Sumat uprising (Vietnamese: Phong trào Hồi Giáo của Katip Sumat) was a revolt in 19th century Southern Vietnam. It was led by Cham Muslim leader Katip Sumat. This is the only ever-recorded jihad war involving Vietnam.\n\nBackground\nThe remnant of the Champa Kingdom in a small enclave in Southeast part of Mainland Southeast Asia, Panduranga, known to the Vietnamese as Principality of Thuận Thành, had been annexed by the Vietnamese from the Nguyen lord's domain in 1692, who vassalized it inste",
  "Đại Việt–Khmer War": "The Đại Việt–Khmer War were a series of wars and conflicts fought between the Kingdom of Đại Việt and the combined forces of Champa and the Khmer Empire between 1123 and 1150.\n\nBackground\nIn 1127, King Ly Nhan Tong died. 12-year-old Ly Than Tong ascended the throne. Taking advantage of this opportunity, King Suryavarman II immediately sent troops to invade Dai Viet.\n\nThe conflicts\nThe first attack was in 1128 when King Suryavarman II led 20,000 soldiers from Savannakhet to Nghệ An but were route",
  "Lam Sơn uprising": "The Lam Sơn uprising (simplified Chinese: 蓝山起义; traditional Chinese: 藍山起義; Vietnamese: Khởi nghĩa Lam Sơn; chữ Hán: 起義藍山, also known as simplified Chinese: 蓝山蜂起; traditional Chinese: 藍山蜂起; Vietnamese: Lam Sơn phong khởi; chữ Hán: 藍山蜂起) was a Vietnamese rebellion led by Lê Lợi in the province of Jiaozhi from 7 February 1418 to 10 December 1427 against the rule of Ming China. The success of the rebellion led to the establishment of the Later Lê dynasty by Lê Lợi in Đại Việt.\n\nBackground\nThe Ming D",
  "Military of Champa": "The military of Champa was the primary military force of Champa. The army and navy fought numerous wars and for defending their kingdom against the Chinese, Khmer, and Vietnamese empires, and also thwart piracy, especially Chinese and Malay pirates. The Champa military was known for its skill and innovation in warfare, particularly in shipbuilding and naval warfare. The Champa Kingdom was located in a strategic position on the coast, which allowed them to develop a strong navy and engage in mari",
  "Military reforms resulting from the Yên Bái mutiny": "The failure of the Yên Bái mutiny by Vietnamese soldiers in the French colonial army on February 10, 1930, caused the French authorities to engage in a reform of military policies which were aimed at preventing future uprisings. French trust in the Vietnamese soldiers' loyalty as colonised subjects who were simultaneously enforcers of colonial order had never been high, and the mutiny resulted in increased safeguards against Vietnamese soldiers in an attempt to prevent future incidents. Around 8",
  "Ming conquest of Đại Ngu": "The Ming invasion of Viet (Chinese: 明入越/平定交南), known in Vietnam as the Ming–Đại Ngu War (traditional Chinese: 大虞與明戰爭; simplified Chinese: 大虞与明战争; Vietnamese: Chiến tranh Đại Ngu–Đại Minh / cuộc xâm lược của nhà Minh 1406–1407; Hán Nôm: 戰爭大虞 – 大明) was a military campaign against the kingdom of Đại Ngu (present-day northern Vietnam) under the Hồ dynasty by the Ming dynasty of China. The campaign began with Ming intervention in support of a rival faction to the Hồ dynasty which ruled Đại Ngu, but e",
  "Mông Đồng": "Mông Đồng (Chữ Hán: 艨艟) is a class of near-shore warship and riverine boat that played a dominant role in medieval Vietnamese naval forces for over a thousand years.\n\n\n== Gallery ==",
  "Naval history of Vietnam": "Army and warfare made their first appearance in Vietnamese history during the 3rd millennium BC. Throughout thousands of years, wars played a great role in shaping the identity and culture of people inhabited the land which is modern day Vietnam.\n\nEarly period\nFrom the beginning of the founding of the Vietnamese Nation in the 1st millennium BC, the Hùng Vương period spawned many legends of fighting against seaborne invasions of Quynh Chau (now China) from the north and Ho Ton (later to become Ch",
  "Battle of Ngọc Hồi-Đống Đa": "The Battle of Ngọc Hồi-Đống Đa or Qing invasion of Đại Việt (Vietnamese: Trận Ngọc Hồi - Đống Đa; Chinese: 清軍入越戰爭), also known as Victory of Kỷ Dậu (Vietnamese: Chiến thắng Kỷ Dậu), was fought between the forces of the Vietnamese Tây Sơn dynasty and the Qing dynasty in Ngọc Hồi (a place near Thanh Trì) and Đống Đa in northern Vietnam from 1788 to 1789. It resulted in the failure of the Chinese to restore the last Lê emperor Chiêu Thống, who had been usurped by the Tây Sơn. It is considered one o",
  "Olivier de Puymanel": "Victor Olivier de Puymanel (1768 in Carpentras – 1799 in Malacca), Nguyễn Văn Tín (阮文信) or Ông Tín in Vietnamese, was a French construction officer and a French Navy volunteer and adventurer who had an important role in Vietnam in the 18th and 19th century. He played a key role in the modernization of the army of Nguyễn Phúc Ánh (the future Emperor Gia Long).\nOlivier de Puymanel was second-class volunteer on board the French warship Dryade. In 1788 he deserted his ship while in Pulo Condor. He s",
  "Royal Vietnamese army": "The Royal Vietnamese army was the primary military body of the Vietnamese states of Jinghai and Đại Việt and the armed forces of the Vietnamese monarchy from 938 to 1789. It was disbanded and succeeded by the Imperial Vietnamese army of the Nguyễn dynasty in early 19th century.\n\nOrganisation\nMilitary branches\nInfantry\nConscripted-soldiers\nWar elephants\nLight cavalry\nNavy\n\nStrength\nConscription was firstly introduced and used in Vietnam by king Lý Thái Tông in 1042. For a detachment of 50 men, 30",
  "Siamese–Vietnamese wars": "The Siamese–Vietnamese wars were a series of armed conflicts between the Siamese Ayutthaya Kingdom and Rattanakosin Kingdom and the various dynasties of Vietnam mainly during the 18th and 19th centuries. Several of the wars took place in modern-day Cambodia.\nThe political, dynastic, and military decline of the Khmer Empire after the 15th century, known as the Post-Angkor Period, left a power vacuum in the Mekong floodplains of central Indochina. United under strong dynastic rule, both Siam to th",
  "Tân Sở": "Tân Sở citadel was a secret military base in central Vietnam that was built in the 1880s. It was built up by Tôn Thất Thuyết, the regent of the Nguyễn dynasty, in preparation for an uprising against French colonialism.\n\n\n== References ==",
  "Tây Sơn military tactics and organization": "The Tây Sơn rebel army incorporated during the three decades of its existence (from 1771 to 1802) new and unconventional ideas of tactics and organization. Logistic and tactical aspects like intelligence analysis, troop co-operation, transport and movement were radically revised, imposed and coupled with deception, diplomacy and guerilla tactics, that eventually proved remarkably efficient. Conceived and applied by military leader Nguyen Hue under whom the Tây Sơn forces engaged into a series of",
  "Tây Sơn wars": "The Tây Sơn wars or Tây Sơn rebellion, often known as the Vietnamese civil war of 1771–1802, were a series of military conflicts that followed the Vietnamese peasant uprising at Tây Sơn (in Central Vietnam) that was led by three brothers Nguyễn Nhạc, Nguyễn Huệ, and Nguyễn Lữ. These revolutionary forces grew and later overthrew the ruling Vietnamese elite families and the ruling dynasty. The Tây Sơn leaders installed themselves as rulers of Vietnam that held power until they were overthrown by N",
  "Tirailleurs indochinois": "The Tirailleurs indochinois (Vietnamese: Lính tập; Chữ Nôm: 𠔦習) were soldiers of several regiments of local ethnic Indochinese infantry organized as Tirailleurs by the French colonial authorities, initially in Vietnam from 15 March 1880. The most notable, and first established, of these units were the Tonkinese Rifles (French: Tirailleurs tonkinois, Vietnamese: Quân đoàn bộ binh Bắc Kỳ).\n\nHistory\nIn the early days of these regiments the charge was often made that the tirailleurs were prone to de",
  "Trần dynasty military tactics and organization": "During the Mongol invasions of Vietnam the Trần dynasty (1225–1400) successful employed military tactics and strategies including scorched earth and hit and run tactics designed to take advantage of terrain.\n\nOrganization\nThe Royal Vietnamese army had a military force of up to 100,000 soldiers in 1281.\n\nArmy\nCấm quân (Royal army): about 20,000\nLộ quân (Local army): about 80,000\n\nCấm quân\nCấm quân was the force guarding the city of Thăng Long, the capital of Đại Việt. Below are a list of Cấm quân",
  "Philippe Vannier": "Philippe Vannier (Vietnamese name: Nguyễn Văn Chấn / 阮文震, 1762–1842) was a French Navy officer and an adventurer who went into the service of Nguyễn Ánh, the future emperor Gia Long of Vietnam.\n\nLife\nVannier was born in Brittany, in the town of Auray. He had served from 1778 in the Royal French Navy, and had reportedly fought in the American War of Independence.\nPhilippe Vannier entered the service of Nguyễn Ánh in 1789 following the encouragements of Mgr Pigneau de Béhaine. In 1790, Nguyễn Ánh ",
  "Vietnamese armour": "Vietnamese armour (Vietnamese: áo giáp Việt Nam, chữ Hán: 襖甲越南) is military body armour made in the region of Vietnam.\n\nPre-history to 2nd-century\nHistory does not provide records of the development of armour in Bronze Age and Iron Age Vietnam. Physical relics are the only source for studying the origins of the practice.\nThe most common type found in Northern Vietnam is mirror armour, which is a square or rectangular metal or wooden plate fastened to the warrior's chest. This type of armour coul",
  "Vietnamese border raids in Thailand": "After the 1978 Vietnamese invasion of Cambodia and subsequent collapse of Democratic Kampuchea in 1979, the Khmer Rouge fled to the border regions of Thailand, and, with assistance from China, Pol Pot's troops managed to regroup and reorganize in forested and mountainous zones on the Thai-Cambodian border. During the 1980s and early 1990s Khmer Rouge forces operated from inside refugee camps in Thailand, in an attempt to de-stabilize the pro-Hanoi People's Republic of Kampuchea's government, whi",
  "Vietnamese National Army": "The Vietnamese National Army (VNA; Vietnamese: Quân đội Quốc gia Việt Nam, lit. 'Military of the State (or Nation) of Vietnam', chữ Hán: 軍隊國家越南; French: Armée Nationale Vietnamienne, lit. 'Vietnamese National Army') was a State of Vietnam's military force created shortly after the Élysée Accords, where the State of Vietnam was recognized by France as an independent country ruled by Vietnamese Emperor Bảo Đại. It was commanded by Vietnamese General Hinh and was loyal to Bảo Đại. The VNA fought in",
  "Võ Tánh": "Võ Tánh (武 性, ?—1801) was an 18th-century Vietnamese military commander, best known for his role as a general of Nguyễn Ánh, who unified modern-day Vietnam and ruled as Emperor Gia Long.\n\nEarly life\nVõ Tánh was born in Phước Tinh Village, in what was then Bà Rịa (present day Biên Hòa and Đồng Nai). Tanh's elder brother, Võ Nhàn, was a follower and a general of Đỗ Thanh Nhơn, an officer in the Nguyễn army.\n\nKiến Hòa army\nIn 1781, when Đỗ Thanh Nhơn was assassinated by his own leader, Nguyễn Ánh, ",
  "War in Vietnam (1945–1946)": "The 1945–1946 War in Vietnam, codenamed Operation Masterdom by the British, and also known as the Southern Resistance War (Vietnamese: Nam Bộ kháng chiến) by the Vietnamese, was a post–World War II armed conflict involving a largely Indian and French task force and Japanese troops from the Southern Expeditionary Army Group, versus the Vietnamese communist movement, the Viet Minh, for control of the southern half of the country, after the unconditional Japanese surrender.\nWestern countries recogn",
  "Yên Bái mutiny": "The Yên Bái mutiny (Vietnamese: Bạo-động Yên-bái) or officially Yên Báy general uprising (Vietnamese: Tổng khởi-nghĩa Yên-báy) was an uprising of Vietnamese soldiers in the French colonial army on 10 February 1930. This took place in collaboration with civilian supporters who were members of the Vietnam Nationalist Party.\n\nBackground\nThe aim of the Yenbay revolt was to inspire a wider uprising among the general populace in an attempt to overthrow the colonial regime and establish independence. T",
  "List of amphibians of Hoàng Liên National Park": "The following is a list of'amphibians found in Hoàng Liên National Park' in northern Vietnam. The list is based on Tapley, et al. (2017). The park is located within the districts of Sa Pa and Than Uyên of Lào Cai Province, and part of Phong Thổ District in Lai Châu Province.\nHoàng Liên National Park has 81 frog species and 2 salamander species, namely Paramesotriton deloustali and Tylototriton asperrimus. Anuran (frog) families represented are Bombinatoridae (1 species: Bombina maxima), Bufonida",
  "List of fauna of Hà Giang": "The following is a list of terrestrial vertebrate fauna of Mount Tây Côn Lĩnh, western Vị Xuyên District, Hà Giang Province, Vietnam, adapted from Nguyen, et al. (2004). The survey was conducted from 2001 to 2002 in the communes of Cao Bồ, Xín Chải, and Lao Chải. Additional species from Lunde, et al. (2003) are also listed.\n\nMammals\nThere are 47 mammalian species from 22 families and 8 orders.\n\nEulipotyphla\nSoricidae\nSuncus murinus\nBlarinella griselda\nChodsigoa caovansunga\nChodsigoa parca\nCrocid",
  "Protected areas of Vietnam": "Many areas of Vietnam are under protection. While the national reserves cover small areas of scientific significance with restricted access, the national parks also cover wetlands of Ramsar designated areas and BirdLife International inscribed bird areas. The largest of the national parks initially covered were the Cúc Phương National Park, the Cát Tiên National Park, and the Côn Đảo National Park  which to start with were forest areas cum reserves or prohibited areas. The objective for creating",
  "Wildlife of Vietnam": "The wildlife of Vietnam is rich in flora and fauna as reflected by its unique biodiversity. Saola, rare and antelope-like animal categorized under the bovine subfamily, was found in 1992 in Vũ Quang National Park. In the 1990s, three other muntjac species, the deer-like Truong Son muntjac (found in Bạch Mã National Park), giant muntjac (found in Vũ Quang National Park) and Pu Hoat muntjac (found in Pù Hoạt, Nghệ An), were also discovered.  Conservation protection and scientific studies of the ec",
  "Postage stamps and postal history of Indochina": "This is a survey of the postage stamps and postal history of Indochina.\n\nFirst stamps\nThe postage stamps of French Indochina begin on May 16, 1886, with the overprinting of \"5\" or \"5 C. CH.\" on the generic stamps of the French Colonies, for use in Cochinchina (mainly Saigon).\nOn January 21, 1888, stamps crudely overprinted A & T (meaning Annam & Tonkin), along with a \"1\" or \"5\", and also on the generic colonies stamps, were issued for those territories.  The example at right was cancelled at Han",
  "Postage stamps and postal history of Annam and Tongking": "A concise postal history of French Annam protectorate and Tongking protectorate, former territories of colonial French Indochina, that were located in present-day Vietnam. Dates\n1888 - 1892\n\nStamp issues\nOverview\nThe protectorate government over Annam and Tonkin issued only a single series of stamps. On 21 January 1888 the protectorates overprinted \"A & T\" or \"A – T\" (an abbreviation for the French protectorates of Annam and Tonkin) on nine different French colonial commerce type stamps. These o",
  "Postage stamps and postal history of Vietnam": "The postage stamps of Vietnam were issued by a variety of states and administrations. Stamps were first introduced by the French colonial administration. Stamps specifically for Vietnam were first issued in 1945. During the decades of conflict and partitioning, stamps were issued by mutually hostile governments. The reunification of Vietnam in 1976 brought about a unified postal service.\n\nAdvent of Vietnamese stamps\nStamps in Vietnam were first introduced by the French colonial administration in",
  "Abdication of Bảo Đại": "The abdication of Bảo Đại (Vietnamese: Chiếu thoái vị của Hoàng Đế Bảo Đại) took place on 25 August 1945 and marked the end of the 143-year reign of the Nguyễn dynasty over Vietnam ending the Vietnamese monarchy. The fall of the Nguyễn dynasty also led to the fall of its Empire of Vietnam, de facto controlled by Japan. Emperor Bảo Đại abdicated in response to the August Revolution. A ceremony was held handing power over to the newly established Democratic Republic of Vietnam, which was establish",
  "CIA activities in Vietnam": "CIA activities in Vietnam were operations conducted by the Central Intelligence Agency in Vietnam from the 1950s to the late 1960s, before and during the Vietnam War. After the 1954 Geneva Conference, North Vietnam was controlled by communist forces under Ho Chi Minh's leadership. South Vietnam, with the assistance of the U.S., was anti-communist under Ngo Dinh Diem's leadership. The economic and military aid supplied by the U.S. to South Vietnam continued until 1975. The CIA participated in bot",
  "History of the Communist Party of Vietnam": "This article describes the history of the Communist Party of Vietnam (CPV) (from 1930 to 1945, the Indochinese Communist Party) from its origins in the 1920s through to the consolidation of its position as the ruling party of a united Socialist Republic Vietnam after 1976.\n\nThanh Niên\nThe Communist Party of Vietnam (CPV) originated in 1925. In the spring of that year the young man born Nguyễn Sinh Cung—under the pseudonym Nguyễn Ái Quốc (Nguyen the Patriot) but best known as Hồ Chí Minh (Ho the ",
  "Hyangyak": "The hyangyak (Korean: 향약) was a contractual arrangement that allowed for a degree of local government in the history of Korea and Vietnam.\n\nIn Korea\nDuring the rule of Jungjong (1506–1544), the contract was enforced by the local level officials. Specific details were circulated in text and operated as an informal common law. The hyangyak became the core of Korea's social law and the vehicle of a degree of local autonomy for its villages.\nIt was a stepping stone for the Joseon Dynasty in implemen",
  "Trotskyism in Vietnam": "Trotskyism in Vietnam (Vietnamese: Trăng-câu Đệ-tứ Đảng) was represented by those who, in left opposition to the Indochinese Communist Party (ICP) of Hồ Chí Minh, identified with the call of Leon Trotsky to re-found \"vanguard parties of proletariat\" on principles of \"proletarian internationalism\" and of \"permanent revolution\". Active in the 1930s in organising the Saigon waterfront, industry and transport, Trotskyists presented a significant challenge to the Moscow-aligned party in Cochinchina. ",
  "Dishu system": "Dishu (Chinese: 嫡庶) was an important legal and moral system involving marriage and inheritance in the Chinese cultural sphere.\nIn pre-modern eras, upper-class men in China, Japan, Korea, and Vietnam  often had more than one spouse to ensure the birth of a male heir to their assets and titles. In China, a priority system was created to rank the offsprings' entitlement to this inheritance. Under this system, a man was allowed one official wife, called a zhengshi (正室, pronounced seishitsu in Japane",
  "Eunuchs in Vietnam": "A eunuch ( YOO-nək)  is a man who has been castrated. Throughout history, castration often served a specific social function.\nRegarding eunuchs, the Vietnamese adopted the eunuch system and castration techniques from China. Records show that the Vietnamese performed castration in a painful procedure by removing the entire genitalia with both penis and testicles being cut off with a sharp knife or metal blade. The procedure was agonizing since the entire penis was cut off. The young man's thighs ",
  "History of the Jews in Vietnam": "The history of the Jews in Vietnam begins in the 19th century. Jews are a minor ethno-religious group in Vietnam, consisting of only about 300 people as of 2007. Although Jews have been present in Vietnam and Judaism has been practiced since the late 19th century, most adherents have been, and remain today, expatriates, with few to no native Vietnamese converts.\n\nNguyen Dynasty and French protectorate\n19th century\nThe first Jews to visit Vietnam likely arrived during the Nguyễn dynasty and follo",
  "New Economic Zones program": "The New Economic Zones program (Vietnamese: Xây dựng các vùng kinh tế mới) was implemented by the communist Việt Cộng and Socialist Republic of Vietnam after the Fall of Saigon. Between 1975 and 1980, more than 1 million northerners migrated to the south and central regions formerly under the Republic of Vietnam. This program, in turn, displaced around 750,000 to over 1 million Southerners from their homes and forcibly relocated them to uninhabited mountainous forested areas. Properties of evict",
  "Slavery in Vietnam": "The practice of slavery in Vietnam persisted since the Hồng Bàng period. Vietnam has been both a source and a destination for slaves.\n\nHồng Bàng period\nDuring the Hồng Bàng period, the society was divided into three classes consisting of kings, citizens and slaves. A slave, the lowest class, served the aristocracy.\n\nChinese rule\nDuring the Chinese domination period, Vietnamese girls were sold as sex slaves to the Chinese.  A large trade developed where the native girls of Nam Viet were enslaved "
}