{
  "Lịch sử Việt Nam": "Lịch sử Việt Nam nếu tính từ lúc có mặt con người sinh sống thì đã có hàng vạn năm trước Công Nguyên, còn tính từ khi cơ cấu nhà nước được hình thành thì vào khoảng từ năm 700 năm trước công nguyên.\nCác nhà khảo cổ đã tìm thấy các di tích chứng minh loài người đã từng sống tại Việt Nam từ thời đại đồ đá cũ thuộc nền văn hóa Tràng An, Ngườm, Sơn Vi và Soi Nhụ. Vào thời kỳ đồ đá mới, nền văn hóa Hòa Bình – Bắc Sơn tại vùng này đã phát triển về chăn nuôi và nông nghiệp, đặc biệt là kỹ thuật trồng l",
  "Niên biểu lịch sử Việt Nam": "Niên biểu lịch sử Việt Nam là hệ thống các sự kiện lịch sử Việt Nam nổi bật theo thời gian từ các thời tiền sử, huyền sử, cổ đại, trung đại, cận đại cho tới lịch sử hiện đại ngày nay.\n\nThời tiền sử\nThời đại đồ đá cũ\n25.000 TCN–7.000 TCN: Văn hóa Soi Nhụ\n23.000 TCN: Văn hóa Ngườm\n23.000 TCN–1.000 TCN: Văn hóa Tràng An\n20.000 TCN–12.000 TCN: Văn hóa Sơn Vi\n\nThời đại đồ đá mới\n12.000 TCN–10.000 TCN: Văn hóa Hòa Bình\n10.000 TCN–8.000 TCN: Văn hóa Bắc Sơn\n8.000 TCN–6.000 TCN: Văn hóa Quỳnh Văn\n7.000 ",
  "12 sứ quân": "12 sứ quân là những vị thủ lĩnh chiếm giữ các vùng lãnh thổ để hình thành lên thời kỳ loạn 12 sứ quân trong lịch sử Việt Nam. Tên tuổi của họ được chép trong các chính sử như Đại Việt sử lược, Đại Việt sử ký toàn thư,... Cuốn chính sử \"Lịch triều hiến chương loại chí\" còn trang trọng xếp 12 sứ quân vào danh sách dòng chính thống các bậc đế vương bởi trong số các sứ quân cai trị nhiều người đã xưng Vương hoặc được tôn xưng là Vương và đóng góp nhiều cho cuộc sống người Việt thời bấy giờ. Hiện nay",
  "Âu Lạc": "Âu Lạc (chữ Hán:甌貉/甌駱;) là nhà nước cổ của người Việt cổ được thành lập tại miền Bắc Việt Nam bởi một nhân vật có thật tên là Thục Phán (An Dương Vương). Nhà nước này đã thống nhất 2 bộ tộc Âu Việt - Lạc Việt (Sử gọi là Văn Lang) lại với nhau và đã bảo vệ đất nước thành công trước cuộc xâm lược của nhà Tần, nhưng sau cùng, nhà nước sụp đổ do thất bại trước Nam Việt của Triệu Đà (một quan lại nhà Tần), tạo cơ sở cho nhà Hán xâm lược sau này.\nNhà nước này kế tục nhà nước mang tính truyền thuyết Vă",
  "Bách Việt": "Việt (tiếng Trung: 越/粵; bính âm: yuè), hoặc Bách Việt (tiếng Trung: 百越/百粵; bính âm: bǎi yuè, bǎik wyuèt), là các nhóm dân cư thuộc Ngữ hệ Nam Á và Ngữ hệ Kra-Dai định cư và sinh sống ở tại vùng đất phía Nam Trường Giang mà chiếu theo lãnh thổ nhà Hán thì hiện bao trọn miền Nam Trung Quốc và Đồng bằng sông Hồng của Bắc Bộ Việt Nam. Đây cũng là từ cổ chỉ vùng đất mà các bộ tộc này sinh sống hoặc mang tính văn hóa hoặc ngôn ngữ có liên quan. Trong tiếng Trung Quốc cổ, các chữ (越, 粵, 鉞) đã thường đư",
  "Bắc thuộc": "Bắc thuộc chỉ thời kỳ Việt Nam bị đặt dưới quyền cai trị của các triều đại Trung Quốc.\n\nKhái quát\nTrong thời gian này Việt Nam bị đặt dưới quyền cai trị của các triều đình của phương Bắc như:\n\nBắc thuộc lần thứ nhất (179 hoặc 111 TCN - 40): Thời kỳ này kết thúc với Khởi nghĩa Hai Bà Trưng giành độc lập khỏi nhà Đông Hán.\nBắc thuộc lần thứ hai (43 - 541): nhà Đông Hán, Đông Ngô, Tào Ngụy, nhà Tấn, nhà Tề, nhà Lương\nBắc thuộc lần thứ ba (602 - 939): nhà Tùy, nhà Đường, Nam Hán. Có giai đoạn Việt N",
  "Bồn Man": "Muang Phuan (Lao: ເມືອງພວນ, phát âm [mɯ́aŋ pʰúan]; Country of Phuan) hay Xieng Khouang (tiếng Lào: ຊຽງຂວາງ, phát âm [síaŋ kʰwǎːŋ]), người Việt gọi là Bồn Man (盆蠻), Mường Bồn, Mường Phăng hay Trấn Ninh (鎮寧), là một quốc gia cổ từng tồn tại ở khu vực cao nguyên tỉnh Xiêng Khoảng, một phần các tỉnh Hủa Phăn đến Khăm Muộn, ở phía Đông nước Lào, và một phần phía tây các tỉnh miền Bắc Trung bộ Việt Nam (khoảng Nghệ An đến Quảng Bình) nước Việt Nam hiện nay. Vùng đất này từng bị chi phối, tranh giành b",
  "Các dân tộc tại Việt Nam": "Hiện nay Việt Nam có 54 dân tộc và 1 nhóm \"người nước ngoài\". Bản Danh mục các dân tộc Việt Nam này được Tổng cục Thống kê Việt Nam của chính phủ Việt Nam đưa ra trong Quyết định số 121-TCTK/PPCĐ ngày 02 tháng 3 năm 1979.\n\nNguồn gốc\nDân số các dân tộc Việt Nam hiện nay\nTheo số liệu điều tra dân số và nhà ở năm 2019, tổng số dân của Việt Nam vào thời điểm 0h ngày 01/4/2019 là 96.208.984 người, trong đó dân số nam là 47.881.061 người (chiếm 49,8%) và dân số nữ là 48.327.923 người (chiếm 50,2%). Vớ",
  "Cải cách ruộng đất tại miền Bắc Việt Nam": "Cải cách ruộng đất tại miền Bắc Việt Nam là chương trình nhằm phân chia lại ruộng đất nông thôn, xóa bỏ văn hóa phong kiến, tiêu diệt các thành phần phản quốc (theo Pháp, chống đất nước), phản động (chống chính quyền) như địa chủ phản cách mạng, Việt gian, cường hào cộng tác với Pháp... được Đảng Lao động Việt Nam và Chính phủ Việt Nam Dân chủ Cộng hòa thực hiện vào những năm 1953–1956. Theo Luật Cải cách ruộng đất thì Cải cách ruộng đất có mục tiêu \"thủ tiêu quyền chiếm hữu ruộng đất của thực d",
  "Cải cách thể chế Việt Nam 2024–2025": "Cải cách thể chế Việt Nam 2024–2025 là một cuộc cải cách trên quy mô lớn từ trung ương đến địa phương ở Việt Nam, phạm vi trải rộng từ khu vực Đảng, các đoàn thể đến các cơ quan, đơn vị hành chính như các Bộ, ngành, các địa phương trong cả nước. Phạm vi của cuộc cải cách vô cùng sâu rộng và làm thay đổi căn bản bộ máy của cả Đảng, các cơ quan đoàn thể, Chính phủ, các Bộ, ngành và các địa phương ở Việt Nam.\nCuộc cải cách được chính thức khởi động sau bài viết \"Tinh – Gọn – Mạnh – Hiệu năng – Hiệu",
  "Cải tạo lao động": "Cải tạo lao động là tên gọi hình thức giam giữ mà pháp luật một số nước thực hiện đối với một bộ phận các nhân vật mà các chính phủ sở tại kết án vì cách hành vi vi phạm pháp luật, vướng vào tệ nạn xã hội hoặc là các nhân vật hoạt động chống chính phủ hoặc là tù nhân chiến tranh. Đây là một hình thức xử phạt hay răn đe bằng giam giữ kết hợp giáo dục và lao động bắt buộc. Đối với thành phần lực lượng thù địch, mô hình cải tạo lao động này được Liên Xô phổ biến và phát triển quy mô. Mô hình này cũ",
  "Cao Lỗ": "Cao Lỗ (277 TCN - 179 TCN), còn gọi là Cao Thông, Đô Lỗ, Thạch Thần hay Đại Than Đô Lỗ Thạch Thần, là một tướng tài của An Dương Vương (Thục Phán), quê quán tại xã Cao Đức, huyện Gia Bình, tỉnh Bắc Ninh ngày nay. Ông từng làm bộ hạ của Hùng Vương thứ 18 nhưng không được trọng dụng. Khi Âu Việt xâm lược Văn Lang, phò mã là Nguyễn Tuấn tử trận, vua Hùng phải tự tử, ông chán nản bỏ vào rừng sống ẩn dật. Sau này Thục Phán giết được danh tướng Đồ Thư và đánh tan 50 vạn đại quân nhà Tần, ông mới cảm p",
  "Chia cắt Việt Nam": "Sự chia cắt Việt Nam là tình trạng cắt cứ sâu sắc và phân tranh mạnh mẽ mà quyết liệt trên các vùng miền của các lực lượng chính trị - xã hội - quân sự và ý thức hệ ở nước Việt Nam.\nLãnh thổ Việt Nam từng bị chia cắt nhiều lần nhưng đáng kể là 2 lần chia cắt: Lần chia cắt lần 1 là lần chia cắt thời Trịnh - Nguyễn phân tranh (1600-1787), lần 1 bắt đầu khi chúa Nguyễn Hoàng ly khai khỏi triều đình nhà Hậu Lê và kết thúc khi quân Tây Sơn tiến ra bắc tiêu diệt chúa Trịnh; lần 2 là lần chia cắt thời ",
  "Chiến dịch K8": "Chiến dịch K8 hay chiến dịch K.8, Kế hoạch 8 là một chiến dịch trong cuộc chiến tranh Việt Nam kéo dài từ tháng 8 năm 1966 đến cuối năm 1967. Đây là cuộc trường chinh sơ tán bằng đường bộ hơn 30.000 học sinh từ 5 đến 15 tuổi ở Quảng Bình, Quảng Trị (các vùng Vĩnh Linh, Gio Linh, Cam Lộ) ra sinh sống và học tập ở các tỉnh phía Bắc là Nghệ An, Thanh Hóa, Ninh Bình, Nam Hà, Thái Bình. Chiến dịch này do Đảng Cộng sản Việt Nam và chủ tịch Hồ Chí Minh chủ trương nhằm di chuyển những người không thể cầ",
  "Chiến tranh Đại Việt – Đế quốc Khmer": "Chiến tranh Đại Việt – Đế quốc Khmer hay Chiến tranh Đại Việt – Chân Lạp là một loạt các xung đột và tranh chấp quân sự xảy ra  trong khoảng thời gian từ năm 1123 đến năm 1150, giữa một bên là nhà nước Đại Việt triều Lý và một bên là liên minh Chăm Pa (tên gọi theo sách sử thời kỳ này là Chiêm Thành) – Đế quốc Khmer (tên gọi theo sách sử thời kỳ này là Chân Lạp).\n\nBối cảnh\nLúc này, Đại Việt đang ở thế dễ bị tổn thương do nội chiến và xung đột với các nước láng giềng. Năm 1127, Thái tử Lý Dương H",
  "Chiến tranh đổ bộ của Việt Nam trong lịch sử": "Chiến tranh đổ bộ là một khái niệm trong lĩnh vực quân sự, chỉ loại hoạt động quân sự sử dụng các tàu thuyền đi biển để tấn công và đổ quân. Hoạt động này nhắm đến một bờ biển có hoặc có thể có quân địch phòng ngự tại vị trí đổ bộ được xác định trước. Chiến dịch đổ bộ quy mô lớn bằng đường biển đầu tiên của Việt Nam được ghi nhận trong sử sách diễn ra từ hơn 1.000 năm trước.\nCác cuộc vận chuyển quân bằng đường biển đã được tiến hành bởi thủy quân chúa Trịnh khi tấn công Đàng Trong; tiến hành bởi",
  "Chiến tranh Hán – Nam Việt": "Chiến tranh Hán – Nam Việt là một cuộc chiến tranh giữa Nhà Hán (còn gọi là Nhà Tây Hán) và nước Nam Việt thời Nhà Triệu vào cuối thế kỷ 2 trước Công nguyên.\n\nBối cảnh lịch sử\nNăm 221 trước công nguyên (TCN), sau khi Tần Thủy Hoàng thống nhất Trung Nguyên đã cho xây dựng một nhà nước trung ương tập quyền phong kiến. Tham vọng xâm chiếm lãnh thổ không dứt, Tần Thủy Hoàng tiếp tục sai Đồ Thư đem quân, sai Sử Lộc đào ngòi vận lương đi đánh lấy Bách Việt, trong đó là một dải các tỉnh Quảng Đông, Quả",
  "Chiến tranh Tùy–Vạn Xuân": "Chiến tranh Tùy–Vạn Xuân là một cuộc xung đột quân sự giữa nhà Tùy của Trung Quốc và nhà Tiền Lý quốc hiệu Vạn Xuân của Việt Nam vào năm 602.\nNăm 601, Lý Phật Tử bị triệu sang Trung Hoa chầu Tùy Văn Đế. Tuy nhiên, ông đã trì hoãn việc tham dự và cuối cùng đã nổi loạn vào năm 602, mặc dù ông đã công nhận chính quyền nhà Tùy vào năm 595. Ông tập trung lực lượng quân sự của mình tại thành Cổ Loa và Long Biên. Năm 602, tướng Lưu Phương lãnh đạo quân đội nhà Tùy trong cuộc xâm lược vào Tiền Lý.\nQuân ",
  "Chủ nghĩa dân tộc Việt Nam": "Chủ nghĩa dân tộc Việt Nam, là một hình thức của chủ nghĩa dân tộc tại Việt Nam, nhằm thúc đẩy quá trình thống nhất (đồng hóa) văn hóa và tôn vinh bản sắc dân tộc của người Việt tại Việt Nam.\n\nLịch sử\nTrong thời kỳ Âu Lạc và Nam Việt，chủ nghĩa dân tộc không được thể hiện rõ do hệ thống cơ cấu quyền lực nhà nước không đủ mạnh. Tuy nhiên sau đó đã có rất nhiều cuộc khởi nghĩa nổ ra trong suốt nghìn năm Bắc thuộc của các triều đại Trung Hoa, và cuối cùng giành lại được độc lập sau trận Bạch Đằng nă",
  "Chủ nghĩa lý lịch ở Việt Nam": "Chủ nghĩa lý lịch ở Việt Nam là hệ thống các chủ trương, lý luận, biện pháp nhằm thực hiện niềm tin là mọi việc đang, sẽ diễn ra đều bắt nguồn từ những việc đã có sẵn và mong muốn kế thừa công lao, thành quả của thế hệ đi trước của giai tầng thống trị hoặc ngăn cấm cơ hội sống còn, phát triển của thế hệ hiện tại của giai tầng bị trị hoặc giai tầng thống trị cũ, bằng cách phân biệt đối xử giữa các cá nhân.\n\nTổng quan\nBằng chứng cụ thể, lý luận, và biện pháp của chủ nghĩa lý lịch ở Việt Nam là tờ ",
  "Cung điện Phiên Ngung": "Di tích cung điện Phiên Ngung hay di tích cung vua nhà Triệu (giản thể: 南越国宫署遗址; phồn thể: 南越國宮署遺址; bính âm: Nányuèguó gōngshǔ yízhǐ; Hán-Việt: Nam Việt quốc cung thự di chỉ) nằm trong quần thể tàn tích cung điện, công trình kiến trúc đá ngầm và vườn thượng uyển của hai thời kỳ lịch sử từ nhà Triệu nước Nam Việt (trường hợp này còn gọi là Cố cung Phiên Ngung) cho đến nước Nam Hán thế kỷ 10 tại kinh đô Phiên Ngung (nay là thành phố Quảng Châu, tỉnh Quảng Đông, Trung Quốc). Trong đó, di tích cung ",
  "Cửu tự": "Cửu tự (chữ Hán: 九寺), Ngũ tự (五寺), hay Lục tự (六寺), là những thuật ngữ chung để chỉ các cơ quan cao cấp tại triều đình trong các triều đình phong kiến Trung Quốc hoặc Việt Nam. Đây là những cơ quan thuộc triều đình trung ương, làm nhiệm vụ thừa hành sự vụ.\n\nTừ nguyên\nChữ Tự (寺) nguyên nghĩa xuất phát từ một từ biệt xưng của các hoạn quan: \"tự nhân\" (寺人). Thời nhà Tần, cơ cấu các hoạn quan phụ trách chính vụ được gọi là \"tự\". Đến thời nhà Hán, \"tự\" trở thành từ thông xưng để chỉ các quan thự của ",
  "Da vàng hóa chiến tranh": "Da vàng hóa chiến tranh hay Vàng hóa chiến tranh là một chiến lược quân sự mà thực dân Pháp sử dụng trong quá trình xâm chiếm Việt Nam thế kỷ 19 chống lại nhà Nguyễn, và sau này là trong Chiến tranh Đông Dương (1945-1954) nhằm chống lại phong trào kháng chiến chống Pháp do Việt Minh lãnh đạo. Nó được đề ra và thực hiện từ năm 1949, sau khi quân Pháp đã thất bại trong chiến lược \"Đánh nhanh thắng nhanh\" và bắt đầu bị sa lầy, kiệt sức tại chiến trường Đông Dương.\n\nThời Pháp thuộc\nThời Pháp thuộc, ",
  "Danh sách cuộc chiến tranh liên quan đến Việt Nam": "Đây là danh sách các cuộc chiến tranh liên quan Việt Nam bao gồm có sự tham gia của Việt Nam hoặc xảy ra trên lãnh thổ Việt Nam. Trong danh sách này, ngoài những cuộc kháng chiến chống xâm lược và chủ động tấn công, còn có bảng thống kê tất cả những cuộc tranh quyền đoạt vị trong nội bộ hoàng thất, những cuộc khởi nghĩa nông dân, những cuộc hỗn chiến giữa các phe phái tướng lĩnh quan lại, giữa những tập đoàn quân phiệt cát cứ và các lãnh chúa địa phương.\n\nChú thích màu:\n     Đỏ: liên quan đến Tr",
  "Danh sách cuộc nhường ngôi trong lịch sử Việt Nam": "Dưới đây là danh sách ghi nhận những cuộc nhường ngôi trong lịch sử Việt Nam:\n\nTự nguyện nhường ngôi\nNhường ngôi nhưng vẫn giữ quyền nhiếp chính\nKhông rõ năm bao nhiêu trước công nguyên, Hùng Duệ Vương (tức Hùng Vương thứ XVIII) Huệ Lang truyền cho con trưởng nối ngôi xưng là Hùng Kính Vương (tức Hùng Vương thứ XIX). Nhưng Hùng Kính Vương chỉ làm vua được 6 năm thì mất nên Hùng Duệ Vương lại lên làm vua lần thứ hai, do thời gian làm vua quá ngắn ngủi nên sử sách không đề cập, sự kiện này chỉ đượ",
  "Danh sách người đứng đầu lãnh thổ Việt Nam thời Bắc thuộc": "Bắc thuộc là danh từ chỉ thời kỳ Việt Nam bị đặt dưới quyền cai trị của các triều đại Trung Quốc, được coi như một đơn vị hành chính của Trung Quốc, tùy theo thời kỳ lịch sử, có thể là Châu, Quận, Đô Hộ Phủ hay Phiên Trấn.\nChính quyền trung ương Trung Quốc cắt cử quan lại sang để cai trị, cũng lại theo cách gọi và phân chia khu vực của từng triều đại mà viên quan đó có thể là: Châu thái thú, Thứ sử, Châu mục, Thái thú, Kinh lược sứ hoặc Tiết độ sứ...\nDưới đây là bảng thống kê được tổng hợp từ cá",
  "Danh sách quyền thần, lãnh chúa và thủ lĩnh các cuộc nổi dậy có ảnh hưởng lớn trong lịch sử Việt Nam": "Trong lịch sử Việt Nam, ngoài những triều đại hợp pháp ổn định về nhiều mặt từ kinh tế, chính trị đến văn hóa xã hội và tồn lại lâu dài còn có những chính quyền tự chủ là tự lập chưa cấu thành nên chế độ. Nhiều chính quyền chỉ tồn tại ngắn ngủi hoặc chưa thực sự xưng vương xưng đế, có những chính thể tuy cũng đã thế tập tước vị nhiều đời và thực sự cầm quyền nhưng danh nghĩa vẫn chỉ là bề tôi hay thế lực cát cứ độc lập nhưng có tầm ảnh hưởng không nhỏ trong thời đại mà chúng tồn tại.\n\nNhà Triệu ",
  "Danh sách trận đánh trong lịch sử Việt Nam": "Đây là danh sách các trận đánh, chiến dịch, cuộc vây hãm, hành quân, các cuộc giao tranh trong lịch sử Việt Nam, diễn ra trên lãnh thổ Việt Nam, qua các triều đại và các thời kì. Danh sách này sẽ chứa cả những cuộc chiến tranh, khởi nghĩa mà sử sách không chép chi tiết về các trận đánh trong đó. Danh sách này sẽ không bao gồm những vụ đảo chính và tranh chấp ngôi vị.\n\nNhà Tiền Lý (544 - 603)\nNhà Ngô (938 - 967)\nTrận Bạch Đằng, 938\n\nNhà Đinh (968-980)\nDẹp Loạn 12 sứ quân\n\nNhà Tiền Lê (980 - 1009)",
  "Danh sách truy tôn vua chúa Việt Nam": "Trong lịch sử Việt Nam thời kỳ phong kiến, có một số người dù chưa hề làm vua, nhưng do có quan hệ thân thích với dòng họ các vua chúa nên được các vương triều truy tôn danh hiệu vua chúa. Tương tự như một số nước Trung Quốc và Triều Tiên.\n\nThân thế\nNhững người được truy tôn vua chúa có nhiều xuất phát điểm khác nhau:\n\nVới những người là tổ tiên, cha mẹ của vua khai quốc một triều đại, thì phần nhiều trong số họ đã qua đời khi còn là thân phận thường dân hoặc có chức tước rất nhỏ trong bộ máy tr",
  "Dân chủ tại Việt Nam": "Dân chủ tại Việt Nam đề cập đến tình hình dân chủ và các vấn đề liên quan đến dân chủ tại Việt Nam. Nghị quyết Đại hội đại biểu toàn quốc lần thứ X Đảng Cộng sản Việt Nam khẳng định sớm đưa Việt Nam ra khỏi tình trạng kém phát triển, thực hiện \"dân giàu, nước mạnh, xã hội công bằng, dân chủ, văn minh\". Hiện nay, văn bản pháp lý cao nhất quy định về dân chủ nói chung tại Việt Nam là Hiến pháp Việt Nam 2013, ở cấp cơ sở thì có Pháp lệnh thực hiện dân chủ ở xã, phường, thị trấn.\nTheo điều 4 Hiến ph",
  "Di cư của người Việt Nam": "Di cư của người Việt Nam là nói đến di cư của người Việt Nam trong nước và ra nước ngoài trong lịch sử tới nay. Người Việt Nam do tác động của chiến tranh, kinh tế và chính trị đã có nhiều đợt di cư lớn.\n\nDi cư thời phong kiến\nXem thêm Nam tiến\nSuốt thời phong kiến, luồng di cư chủ đạo của người Việt Nam là từ bắc xuống nam. Theo sau các đợt xâm chiếm và mở rộng lãnh thổ qua các triều đại là những đợt di dân lớn. Ngoài ra sử sách cũng ghi nhận một số nhóm nhỏ lẻ di cư chính trị ra nước ngoài, ch",
  "Đại Việt": "Đại Việt (chữ Hán: 大越) tức Đại Việt quốc (chữ Hán: 大越國) là quốc hiệu Việt Nam tồn tại trong 2 giai đoạn từ năm 1054 đến năm 1400 và từ năm 1428 đến năm 1804.\n\nLịch sử\nTên gọi này chính thức có từ thời trị vì của vua Lý Thánh Tông (1054 – 1072), vua thứ ba của nhà Lý. Trước đó, kể từ thời kỳ trị vì của Đinh Bộ Lĩnh, quốc hiệu là Đại Cồ Việt (大瞿越) gồm chữ Đại (大) nghĩa là lớn và chữ Cồ (𡚝) cũng cùng nghĩa là lớn.\nNăm 1400, sau khi thay thế nhà Trần, Hồ Quý Ly, người sáng lập nhà Hồ, đã đổi quốc hi",
  "Đại Việt lịch triều đăng khoa lục": "Đại Việt lịch triều đăng khoa lục (大越歷朝登科錄) còn gọi là Đỉnh khiết Đại Việt lịch triều đăng khoa lục (鼎鍥大越歷朝登科錄)  là bộ sách gồm 4 quyển ghi lại các khoa thi Hội và danh sách những người đỗ đạt trong các khoa thi đó, bắt đầu từ khoa Ất Mão (1075) đến khoa Kỷ Hợi (1779). Đây là bộ sách in mộc bản hoàn thành vào năm Cảnh Hưng 40 (1779), do Vũ Miên, Phan Trọng Phiên và Uông Sĩ Lãng biên tập; Nguyễn Hoãn hiệu đính. Sách trở thành công cụ quan trọng để tra cứu các vị đỗ đại khoa cùng quê quán và khoa ",
  "Đàng Ngoài": "Đàng Ngoài (chữ Nôm: 唐外) hay Bắc Hà (北河) các tài liệu phương Tây đương thời gọi xứ Đàng Ngoài là Tonkin (hay Tunquin, Tonqueen, Tonquin, Ton Kin...) là tên gọi vùng lãnh thổ Đại Việt kiểm soát bởi Chúa Trịnh, xác định từ sông Gianh (tỉnh Quảng Bình) trở ra Bắc. Kinh đô Đàng Ngoài là Đông Kinh (còn gọi là Kinh Kỳ hay Kẻ Chợ).\n\nTên gọi\nBắc Hà là tên gọi tương đương với Đàng Ngoài, tính từ sông Gianh trở về phương Bắc, được dụng phổ biến vào cuối thế kỷ 18 cho đến đầu thế kỷ 19.\n\nLịch sử\nNăm 1527, ",
  "Đàng Trong": "Đàng Trong (chữ Nôm: 唐冲), hay Nam Hà (chữ Hán: 南河) là tên gọi vùng lãnh thổ Đại Việt do chúa Nguyễn kiểm soát, xác định từ sông Gianh (Quảng Bình) trở vào Nam. Bắt đầu từ năm 1600, khi từ Bắc trở về Thuận Hóa, Nguyễn Hoàng đã xây dựng một thế lực độc lập, điều này dẫn tới nội chiến chia cắt hai miền vào năm 1627, và các đời chúa Nguyễn tiếp sau ở thế đối đầu với thế lực chúa Trịnh (cho đến khi quân Tây Sơn đánh đổ cả 2 dòng chúa và thống nhất 2 miền). Tuy nhiên, các chúa Nguyễn vẫn công nhận Đàn",
  "Đánh giá người Việt Nam": "Đánh giá người Việt Nam là những đánh giá và nhận xét về tư duy, tính cách, tâm lý và tập quán của người Việt Nam qua các thời kỳ khác nhau đã được một số học giả trong và ngoài nước đưa ra trong các tác phẩm báo chí, tác phẩm văn học, các tiểu luận hay các công trình nghiên cứu xã hội học và dân tộc học. Các đánh giá này được nêu ra tại những thời điểm lịch sử khác nhau, bắt đầu từ đầu thế kỷ XX, trong đó có một phần đáng kể về vai trò và tính hai mặt, ưu và nhược điểm của tư duy, tính cách, th",
  "Đoàn cố vấn quân sự Liên Xô tại Việt Nam": "Đoàn cố vấn quân sự Liên Xô tại Việt Nam (tiếng Nga: Группа советских военных специалистов во Вьетнаме) là một đội hình quân sự tổng hợp của Lực lượng Vũ trang Liên Xô được đưa đến Việt Nam Dân chủ Cộng hòa (VNDCCH) theo lời mời của chính phủ Việt Nam Dân chủ Cộng hòa và cá nhân Hồ Chí Minh và hỗ trợ quân sự và kỹ thuật cho Quân đội Nhân dân Việt Nam (QĐNDVN) và Mặt trận Dân tộc Giải phóng miền Nam Việt Nam (MTDT). Theo Tổng cục Tác chiến của Bộ Tổng tham mưu các lực lượng vũ trang Liên Xô, từ t",
  "Đô hộ phủ": "Đô hộ phủ (chữ Hán: 都護府) là các cơ quan quản lý các khu vực biên giới của một số triều đại phong kiến ở Trung Quốc. Nhà Đinh và nhà Trần ở An Nam thời kỳ tự chủ cũng đặt những chức quan phỏng theo thời Đường có chữ \"đô hộ phủ\".\n\nTrung Quốc\nNhà Hán từng đặt ra Tây Vực đô hộ phủ (西域都護府), nhưng không bố trí lâu dài. Đến nhà Đường, đô hộ phủ trở thành cơ quan chính thức. Đã có 6 đô hộ phủ, gồm:\n\nAn Tây đô hộ phủ (安西都護府): được lập ra vào năm 640 tại Cao Xương (Thổ Lỗ Phan) để cai quản khu vực phía na",
  "Đông Dương Cộng sản Đảng": "Đông Dương Cộng sản Đảng là một trong ba tổ chức cộng sản tiền thân của Đảng Cộng sản Việt Nam. Hai tổ chức kia là An Nam Cộng sản Đảng và Đông Dương Cộng sản Liên đoàn.\n\nBối cảnh\nTrong những năm 1920, phong trào cách mạng phản đế quốc, phản phong kiến phát triển mạnh mẽ ở Việt Nam. Một trong những tổ chức cách mạng tích cực nhất lúc bấy giờ là Việt Nam Thanh niên Cách mạng Đồng chí Hội, theo thiên hướng cộng sản do Nguyễn Ái Quốc tổ chức nên năm 1925 ở Quảng Châu (Trung Quốc). Cuối thập niên 19",
  "Giao Châu": "Giao Châu (chữ Hán: 交州) là một châu hoặc phủ thời xưa, bao trùm vùng đất miền Bắc Việt Nam ngày nay. Ban đầu Giao Châu còn bao gồm một phần đất Quảng Tây và Quảng Đông thuộc Trung Quốc ngày nay.\n\nNhà Đông Hán\nNăm 203, Giao Châu được vua Hiến Đế nhà Đông Hán đổi tên từ bộ Giao Chỉ trên cơ sở đề nghị của Sĩ Nhiếp, thái thú quận Giao Chỉ và Trương Tân, thứ sử bộ Giao Chỉ.\nKhi đó Giao Châu là một cấp hành chính (châu), gồm 9 quận là: Giao Chỉ, Cửu Chân, Nhật Nam, Đam Nhĩ, Châu Nhai (Đam Nhĩ và Châu ",
  "Giao Chỉ": "Giao Chỉ (chữ Hán: 交趾) là địa danh một phần lãnh thổ Việt Nam trong lịch sử, từ thời Hùng Vương đến các kỳ thời Bắc thuộc. Nó cũng là tên Bắc Tống và Nam Tống gọi 3 nhà nước của nhà Đinh, nhà Tiền Lê, và nhà Lý từ 975 đến 1164.\n\nTừ nguyên\nHiện có nhiều giả thuyết về nguồn gốc của địa danh Giao Chỉ. Sau đây là một số thuyết giải nghĩa dân gian (folk etymology) dựa trên các văn liệu, sử liệu thời cổ: \n\nTheo thiên Vương Chế (王制) trong Lễ ký (禮記), hai chữ Giao Chỉ (交趾) được dùng để mô tả đặc điểm ng",
  "Hệ đo lường cổ Việt Nam": "Hệ đo lường cổ Việt Nam bao gồm chủ yếu các đơn vị đo số thập phân thường được sử dụng trong phong tục tập quán Việt Nam. Hiện nay, Việt Nam chủ yếu sử dụng Hệ đo lường quốc tế.\n\nKhoảng cách\nCác đơn vị đo độ dài cổ của Việt Nam theo hệ thập phân, ngoại trừ ngũ, dựa trên một cây thước cơ bản.\nTuy nhiên, trước khi Pháp chiếm đóng Đông Dương, đã có nhiều loại thước ở Việt Nam, phục vụ cho các mục đích khác nhau và có độ dài khác nhau. Theo Từ điển tiếng Việt thì trong hệ đo lường cổ Việt Nam có ít ",
  "Hội nghị La Celle Saint Cloud": "Hội nghị La Celle Saint Cloud là nơi phái đoàn Việt Nam Cộng hòa và Chính phủ Cách mạng lâm thời Cộng hòa miền Nam Việt Nam gặp nhau để thảo luận việc thi hành Hiệp định Paris 1973. Hội nghị diễn ra từ ngày 19 tháng 3 năm 1973 đến 16 tháng 4 năm 1974.\n\nLập trường các bên\nViệt Nam Cộng hòa\nVề cơ bản, phía Việt Nam Cộng hòa phủ nhận tính hợp pháp của Cộng hòa miền Nam Việt Nam; phủ nhận tình trạng hai chính quyền (chính quyền Sài Gòn và Chính phủ Cách mạng lâm thời Cộng hòa miền Nam Việt Nam), hai",
  "Huyện (Việt Nam)": "Huyện là đơn vị hành chính địa phương cấp hai ở khu vực nông thôn của Việt Nam. Thuật ngữ \"cấp huyện\" thường được dùng để chỉ toàn bộ cấp hành chính địa phương thứ hai, nghĩa là bao gồm cả thành phố trực thuộc tỉnh, quận, huyện và thị xã.\n\nMột huyện thường được chia thành nhiều xã và có thể có một hay một vài thị trấn hoặc cũng có thể không có thị trấn nào. Một số huyện đảo không phân chia thành các xã, thị trấn do có diện tích hoặc dân số quá nhỏ, thay vào đó chính quyền cấp huyện trực tiếp quả",
  "Kênh Vĩnh Tế": "Kênh Vĩnh Tế là một con kênh chảy qua địa phận hai tỉnh An Giang và Kiên Giang, thuộc vùng Đồng bằng sông Cửu Long. Kênh Vĩnh Tế cùng với kênh Nhà Lê là những kênh đào lớn nhất trong lịch sử Việt Nam thời quân chủ.\n\nNguyên nhân\nKênh Vĩnh Tế đào song song với đường biên giới Việt Nam – Campuchia, bắt đầu từ bờ tây sông Châu Đốc thẳng nối giáp với sông Giang Thành, thuộc thành phố Hà Tiên, tỉnh Kiên Giang ngày nay.\nNguyên nhân là vào năm 1816, khi thành Châu Đốc được đắp xong, Trấn thủ trấn Vĩnh T",
  "Khoa bảng Việt Nam": "Khoa bảng Việt Nam là chế độ khoa cử thời quân chủ tại Việt Nam. Ở thời thượng cổ, sử nước Việt không chép rõ về cách tuyển lựa trí thức. Theo Đào Duy Anh, đến thời Bắc thuộc thì nước Việt mới bắt đầu có Hán học, viên Thái thú Sĩ Nhiếp đã dạy dân Việt thi thư. Đến thời nhà Ngô, nhà Đinh, nhà Tiền Lê, do nước mới dựng, các triều đại chưa có điều kiện để tổ chức nền giáo dục.\nCho đến triều nhà Lý, nhà Trần, 3 tôn giáo là Phật giáo, Đạo giáo, Nho giáo đều được coi trọng. Triều đình nhà Lý đã mở các",
  "Khởi nghĩa Yên Thế": "Khởi nghĩa Yên Thế là một cuộc đối đầu vũ trang giữa những người nông dân ly tán tại vùng Yên Thế Thượng và sau đó là Thái Nguyên, đứng đầu là Hoàng Hoa Thám, với quân Pháp, khi Pháp vừa kết thúc chiến tranh với Trung Quốc và bắt đầu kiểm soát toàn bộ vùng Bắc kỳ những năm cuối thế kỷ 19 trong lịch sử Việt Nam.\n\nNguyên nhân phát sinh\nCuộc khởi nghĩa Yên Thế khởi nguồn tại vùng Yên Thế Thượng. Trước khi thực dân Pháp đặt chân đến vùng này, nơi đây đã là một vùng đất có một cư dân phức tạp, chủ yế",
  "La Dalat": "La Dalat là tên một loại xe hơi giá rẻ do hãng chế tạo xe hơi của Pháp Citroën thông qua công ty con là Công ty xe hơi Sài Gòn sản xuất trong giai đoạn 1970–1975. Loại xe này được hãng Citroën chế tạo năm 1969 và bán ra thị trường vào năm 1970. Tỷ lệ các bộ phận nội địa hóa của La Dalat đạt 25%, đến năm 1975 đạt 40%, cũng là năm hãng Citroën đóng cửa nhà máy tại Việt Nam và chấm dứt sản xuất dòng xe này\nVới mục đích thiết kế nhắm tới những khách hàng bình dân tại các nước có nền kinh tế khó khăn",
  "Lịch sử Chăm Pa": "Lịch sử Chăm Pa là lịch sử các quốc gia của người Chăm gồm: Hồ Tôn, Lâm Ấp, Hoàn Vương, Chiêm Thành (Campanagara) và Thuận Thành (Nagar Cam), thành lập từ năm 192 và kết thúc vào năm 1832.\nTrước thế kỷ thứ II, vùng đất của vương quốc Chăm Pa cổ đã được nhắc đến với tên Hồ Tôn Tinh (trong truyền thuyết), rồi tên huyện Tượng Lâm (thuộc quận Nhật Nam thời nhà Hán) khi nằm dưới sự thống trị của Trung Quốc. Lãnh thổ này được ghi nhận là từ miền Trung trở vào miền Nam Việt Nam, thay đổi tùy thời kỳ. T",
  "Lịch sử chiến tranh Việt – Chiêm": "Chiến tranh Việt – Chiêm là một loạt những cuộc chiến tranh giữa Đại Việt, chính quyền Đàng Trong của người Việt ở phía Bắc và vương quốc Chiêm Thành (Chăm Pa) của người Chăm ở phía Nam. Các cuộc chiến lớn nhất tập trung trong thời gian từ thế kỷ 11 đến thế kỷ 17.\nTừ thế kỷ 10, sau khi giành lại độc lập từ Trung Quốc sau hơn một nghìn năm Bắc thuộc, xây dựng một quốc gia có chủ quyền, Đại Việt bắt đầu có các cuộc chiến tranh trong lịch sử với các quốc gia lân bang như Trung Quốc – Chiêm Thành – ",
  "Lịch sử quân sự Việt Nam": "Lịch sử quân sự Việt Nam hay Quân sử Việt Nam là quá trình hình thành và phát triển các hoạt động quân sự trong suốt chiều dài lịch sử của Việt Nam, bắt đầu từ thời kỳ Văn Lang cho đến nay. Lịch sử quân sự Việt Nam bao gồm các cuộc chiến tranh với các quốc gia bên ngoài, bao gồm các nước láng giềng, các cuộc nội chiến và các cuộc nội chiến có sự can thiệp từ bên ngoài.\nTruyền thống quân sự là nét nổi bật nhất của lịch sử Việt Nam. Lịch sử quân sự Việt Nam xuất hiện từ buổi đầu dựng nước, có một ",
  "Loạn 12 sứ quân": "Loạn 12 sứ quân (chữ Nôm: 亂12使君; chữ Hán: 十二使君之亂, Thập nhị sứ quân chi loạn) là một giai đoạn nội chiến diễn ra vào cuối thời nhà Ngô, kéo dài từ năm 944 sau khi Ngô Quyền mất cho đến khi Đinh Bộ Lĩnh thống nhất đất nước, lập ra nhà Đinh năm 968, được ghi chép trong phần Bản kỷ Ngô sứ quân Ngô Xương Xí.\nCuộc loạn lạc này có nguyên nhân sâu xa từ quá trình phân hóa xã hội thời Bắc thuộc, dẫn đến việc xuất hiện tầng lớp thổ hào, quan lại có thế lực mạnh về kinh tế, chính trị và tạo ra sự phân tán ",
  "Luy Lâu": "Luy Lâu (chữ Hán: 羸婁) là lỵ sở địa phương của quận Giao Chỉ, và cũng là thủ phủ của cả Giao Châu từ năm 111 TCN đến 106 TCN. Luy Lâu thời Bắc thuộc không chỉ là trung tâm chính trị, mà còn là trung tâm kinh tế-thương mại, trung tâm văn hóa-tôn giáo lớn và cổ xưa nhất của Việt Nam, là thủ phủ của Phật giáo khi mới truyền bá vào Việt Nam.\n\nLịch sử\nTrong thời kỳ Bắc thuộc nhà Đông Ngô, Sĩ Nhiếp, một quan chức người Hán được vua Ngô cử làm thứ sử Giao Châu, ông đã cho xây dựng lại thành Luy Lâu, đặt",
  "Mặt trận Quốc gia Thống nhất": "Mặt trận Quốc gia Thống nhất là một liên minh chính trị thành lập ngày 14 tháng 8 năm 1945, gồm các đảng phái quốc gia và những người Trotskyist (nhóm Tranh đấu - Đệ Tứ Quốc tế tại Việt Nam).\nCác tổ chức tham gia:\n\nViệt Nam Quốc gia Độc lập Đảng\nPhong trào Thanh niên Tiền phong (về sau tách khỏi Mặt trận để tham gia Việt Minh)\nNhóm Trí thức\nLiên đoàn Công chức\nTịnh độ cư sĩ Phật hội Việt Nam\nPhật giáo Hòa Hảo\nNhóm Tranh đấu\nĐoàn thể Cao Đài\n\nLịch sử\nNgày ngày 21 tháng 8 năm 1945, Mặt trận Quốc g",
  "Minh thực lục": "Minh thực lục (giản thể: 明实录; phồn thể: 明實錄) là bộ biên niên sử viết về triều Minh Trung Quốc. Bộ sử ghi lại các sự kiện bắt đầu từ thời Minh Thái Tổ tới Minh Hi Tông, tổng cộng mười ba triều vua.\n\nĐặc điểm\nMinh thực lục có giá trị cả về lịch sử lẫn văn hóa, khoa học.\n\nNội dung\nMười ba triều vua trong Minh thực lục không bao gồm các triều vua Minh Huệ Tông, Minh Đại Tông, Minh Tư Tông.\n\nXem thêm\nMinh sử\nBảo huấn\nThanh thực lục\n\nTham khảo\nLiên kết ngoài\n\nAcademia Sinica. \"Veritable Records of the",
  "Mỵ Châu": "Mị Châu (chữ Hán: 媚珠), cũng viết là Mỵ Châu, là một nhân vật truyền thuyết rất nổi tiếng trong lịch sử Việt Nam. Mị Châu là con gái của vua An Dương Vương Thục Phán, người đã đánh bại quân Tần xâm lược, ép Vua Hùng nhường ngôi cho mình và khai sinh ra nước Âu Lạc trong lịch sử Việt Nam. Câu chuyện truyền thuyết về Mị Châu gắn liền với sự tích \"Rải lông ngỗng dẫn đường cho Trọng Thủy\", một điển tích qua đó Mị Châu đã để lộ thông tin quân sự cho chồng là Trọng Thủy, dẫn đến thất bại toàn diện của ",
  "Cải cách hành chính Việt Nam 2016–2020": "Cải cách hành chính Việt Nam 2016–2020 bao gồm các cải cách hành chính đã được thực hiện trong giai đoạn này trên quy mô toàn quốc và theo phân chia các bộ ngành liên quan. Căn cứ trực tiếp để thực hiện chương trình này là Quyết định số 225/QĐ-TTg của Thủ tướng Chính phủ: Phê duyệt Kế hoạch cải cách hành chính nhà nước giai đoạn 2016-2020.\n\nCải cách hệ thống hành chính tỉnh thành\nBỏ nhiều cấp Hội đồng nhân dân\nQuốc hội cho ý kiến về thí điểm không tổ chức Hội đồng Nhân dân cấp phường tại Hà Nội:",
  "Nam tiến": "Nam tiến (Chữ Nho: 南進) là quá trình mở rộng lãnh thổ của người Việt về phương nam trong lịch sử Việt Nam. Nam tiến là một phần quan trọng nhất trong quá trình mở rộng lãnh thổ của dân tộc Việt. Quá trình này đã mở rộng lãnh thổ từ thời điểm độc lập ban đầu cho đến hình dạng lãnh thổ như ngày nay. Nam tiến và bang giao với các triều đại Trung Quốc được xem là hai nội dung quan trọng của lịch sử Việt Nam.\nThời kỳ đầu mới giành được độc lập tự chủ, lãnh thổ Đại Việt bao gồm khu vực đồng bằng châu t",
  "Nam – Bắc triều (Việt Nam)": "Nam – Bắc triều (chữ Hán: 南北朝；1533–1593) là tên gọi của khoảng thời gian nhà Mạc cầm quyền ở tại Thăng Long, gọi là Bắc triều và nhà Hậu Lê bắt đầu trung hưng, chiếm được vùng đất từ Thanh Hóa trở vào Nam, gọi là Nam triều. Thời Nam – Bắc triều kéo dài từ năm 1533 khi Nguyễn Kim mượn danh nghĩa phò vua Lê Trang Tông chiếm được Tây Giai (Thanh Hóa), cho tới năm 1593 khi nhà Mạc mất.\nTàn quân nhà Mạc chạy lên mạn Bắc và được nhà Minh can thiệp cho ở đất Cao Bằng.\n\nHình thành\nSang đầu thế kỷ 16, nh",
  "Nam Hải dị nhân liệt truyện": "Nam Hải dị nhân liệt truyện (chữ Hán: 南海異人列傳, dịch nghĩa: Truyện những người kỳ lạ ở đất Nam Hải), là một tập truyện sưu tầm của Phan Kế Bính về các truyền tích, dã sử nổi tiếng trong giai thoại dân gian Việt Nam.\n\nKhái lược\nTập truyện được in và xuất bản bằng chữ Quốc ngữ lần đầu tiên vào năm 1909. Tập sách được tái bản vào năm 1912 bởi nhà xuất bản Sống Mới. Trong bản này, Phan Kế Bính đã thêm phần Tựa, và ghi thời điểm vào năm Duy Tân thứ 6 (1912). Trong bản 1912, cũng đã ghi nhận có sự tham ",
  "Nam Kỳ": "Nam Kỳ (chữ Hán: 南圻) là lãnh thổ cực Nam của nước Đại Nam triều Nguyễn, là một trong ba kỳ hợp thành nước Việt Nam. Tên gọi này do vua Minh Mạng đặt ra năm 1832.\nTrong thời kỳ Pháp thuộc, chính quyền thực dân duy trì tên gọi 3 xứ của Việt Nam có từ trước đó, nhưng áp dụng chế độ riêng biệt với mỗi xứ: xứ thuộc địa Nam Kỳ, cùng với hai xứ bảo hộ Trung Kỳ và Bắc Kỳ. Danh xưng Nam Kỳ được chính quyền Liên bang Đông Dương của Pháp duy trì cho đến năm 1945 khi được thay bằng tên gọi Nam Bộ. Quốc gia ",
  "Nam Kỳ Lục tỉnh": "Nam Kỳ Lục tỉnh (南圻六省) hay Lục tỉnh (六省), là tên gọi của vùng Nam Bộ vào đầu thời nhà Nguyễn, tức là khoảng thời gian từ 2 năm 1831 và 1832 (cải cách hành chính của Minh Mạng) tới năm 1862 (khi Pháp chiếm 3 tỉnh Miền Đông) và năm 1867 (khi Pháp chiếm nốt 3 tỉnh Miền Tây). Đương thời, người Pháp gọi Nam Kỳ Lục tỉnh bằng cái tên Basse-Cochinchine (tức là vùng Cochinchine \"hạ\" hay vùng Hạ Đàng Trong).\nVùng trước đó thuộc Campuchia, sáp nhập từng phần vào Đàng Trong bắt đầu từ năm 1658 đến năm 1760 ",
  "Nam–Bắc triều": "Nam–Bắc triều là tên gọi chỉ một giai đoạn lịch sử một quốc gia phong kiến có sự phân tranh giữa hai triều đại Nam–Bắc, có thể chỉ:\n\nThời kỳ Nam–Bắc triều (Trung Quốc)\nThời kỳ Nam–Bắc triều (Nhật Bản)\nThời kỳ Nam–Bắc triều (Việt Nam)\nNgoài ra, trong lịch sử Trung Quốc có 1 số giai đoạn nữa tồn tại 2 chính quyền song song nhưng không được liệt vào Nam bắc triều, ví như: Ngụy Tấn và Đông Ngô (263-280) được tính gộp vào thời kỳ Tam Quốc hay Tiền Tần và Đông Tấn (376-383) vẫn thuộc giai đoạn Ngũ Hồ ",
  "Ngày Quốc khánh (Việt Nam)": "Ngày Quốc khánh Việt Nam là ngày lễ chính thức của Việt Nam, diễn ra vào ngày 2 tháng 9 hằng năm, kỷ niệm ngày Chủ tịch Hồ Chí Minh đọc bản Tuyên ngôn độc lập tại Quảng trường Ba Đình, Hà Nội, khai sinh ra nước Việt Nam Dân chủ Cộng hòa, một trong các tiền thân của nước Cộng hòa Xã hội Chủ nghĩa Việt Nam ngày nay.\nVào ngày này, theo Điều 112 Bộ luật Lao động năm 2019, người dân Việt Nam được nghỉ lễ 2 ngày: vào 2/9 và 1 ngày trước hoặc sau (trước đó chỉ được nghỉ vào đúng ngày 2/9).\n\nBối cảnh lị",
  "Ngày Thống nhất": "Ngày lễ 30 tháng 4, tên chính thức là Ngày Giải phóng Miền Nam, thống nhất đất nước, Ngày Chiến thắng, Ngày Thống nhất là một ngày lễ quốc gia của Việt Nam, đánh dấu sự kiện chấm dứt Chiến tranh Việt Nam khi Tổng thống Dương Văn Minh và Thủ tướng Vũ Văn Mẫu của Việt Nam Cộng hòa tuyên bố đầu hàng vô điều kiện Chính phủ Cách mạng lâm thời Cộng hòa miền Nam Việt Nam vào trưa ngày 30 tháng 4 năm 1975. Ngày này là kết quả trực tiếp của Chiến dịch Mùa Xuân năm 1975 và là một mốc quan trọng trong lịch",
  "Nghị quyết 413 của Hội đồng Bảo an Liên Hợp Quốc": "Nghị quyết 413 của Hội đồng Bảo an Liên Hợp Quốc được nhất trí thông qua vào ngày 20 tháng 7 năm 1977, sau khi xem xét đơn xin gia nhập Liên Hợp Quốc của nước Cộng hòa Xã hội Chủ nghĩa Việt Nam, Hội đồng đã đề xuất Đại hội đồng cho phép Việt Nam gia nhập tổ chức này.\n\nTham khảo\nLiên kết ngoài\n\nToàn văn nghị quyết tại UN.org Lưu trữ ngày 25 tháng 5 năm 2012 tại Wayback Machine (PDF)",
  "Ngoại thích": "Ngoại thích (tiếng Trung: 外戚; bính âm: wàiqī; Người thân bên ngoại) là cụm từ thường được dùng trong thời phong kiến tại các nước Á Đông như Trung Quốc, Việt Nam, Nhật Bản, Triều Tiên dùng để chỉ những lực lượng chính trị trong triều đình phong kiến có nguồn gốc là người thân của họ ngoại nhà vua như họ hàng của hoàng hậu, hoàng thái hậu hoặc thái phi.\nDo đặc điểm phong kiến tập quyền cao độ ở phương Đông với quyền lực tập trung hầu hết trong tay vua, lực lượng ngoại thích đôi khi đóng vai trò r",
  "Nguồn gốc người Việt": "Nguồn gốc người Việt Nam để chỉ nguồn gốc của các dân tộc sống ở Việt Nam. Hiện nay chỉ mới được xác định được nguồn gốc của một số dân tộc thiểu số mới hình thành hoặc di cư đến từ thời kỳ có sử như H'Mông, Sán Dìu... Đối với nhiều dân tộc, đặc biệt là người Việt/Kinh, thì còn ở mức giả thuyết. Các giả thuyết nguồn gốc các dân tộc tại Việt Nam được chia ra hai phái:\n\nGiả thuyết bản địa cho rằng các dân tộc tại Việt Nam vốn là chủ nhân của các nền văn hóa thời kỳ đồ đá tại Việt Nam từ 7-20 Ka BP",
  "Người Do Thái tại Việt Nam": "Những người Do Thái đầu tiên thăm Việt Nam được cho trong thời Pháp thuộc vào cuối thế kỷ 19. Trong thời Chiến tranh Việt Nam, các cộng đồng Do Thái tạm được xây dựng ở khắp Việt Nam Cộng hòa, phần lớn là lính Mỹ.\nSau khi chính phủ Việt Nam bắt đầu cải cách kinh tế trong thời kỳ Đổi mới, số người Do Thái đến thăm Việt Nam tăng lên. Năm 1993, Israel thiết lập quan hệ ngoại giao với Việt Nam và mở cửa một tòa đại sứ tại Hà Nội. Mỗi năm, tòa đại sứ này tổ chức một phái đoàn nhân đạo để mang bác sĩ ",
  "Người Nam Việt": "Người Nam Việt (chữ Hán: 南越族 hoặc 南越人; Hán-Việt: Nam Việt tộc hoặc Nam Việt nhân) là tập hợp các dân tộc là chủ nhân của vùng đất Lĩnh Nam thời cổ. Họ là những người bản địa thuộc đại chủng Á.\nNgười Trung Quốc cổ đại đã phân chia những tộc người xung quanh theo hướng la bàn, gọi những tộc người này là Đông Di, Bắc Địch, Tây Nhung và Nam Man (gộp chung thành Tứ Di). Ám chỉ người Nam Việt là người Việt cổ đại ở phương Nam, gọi chung là Bách Việt.\n\nXem thêm\n\n\n== Tham khảo ==",
  "Nhà Hán bành trướng xuống phía nam": "Nhà Hán bành trướng xuống phía nam là một loạt các chiến dịch viễn chinh của quân đội nhà Hán tại vùng đất ngày nay là miền Nam Trung Quốc và miền Bắc Việt Nam. Cuộc nam chinh được khởi xướng từ thời nhà Tần trước đó và kế tục bởi nhà Hán. Các chiến dịch được tiến hành để chinh phục các bộ lạc Bách Việt, dẫn đến sự sáp nhập của Mân Việt vào năm 135 TCN, Nam Việt vào năm 111 TCN và Điền vào năm 109 TCN.\nVăn hóa Hán bén rễ ở các vùng lãnh thổ mới bị chinh phục và các bộ lạc bản địa nơi đây bị đế q",
  "Nhà Hồ": "Nhà Hồ (chữ Nôm: 茹胡, chữ Hán: 胡朝, Hán Việt: Hồ triều) là một triều đại quân chủ trong lịch sử Việt Nam, bắt đầu khi Hồ Quý Ly lên ngôi năm 1400 sau khi giành được quyền lực từ tay nhà Trần và chấm dứt khi Hồ Hán Thương bị quân Minh bắt vào năm 1407 – tổng cộng là 7 năm. Quốc hiệu Đại Việt đã đổi thành Đại Ngu năm 1400.\n\nThành lập\nNhà Hồ do Hồ Quý Ly, một đại quý tộc và đại thần nhà Trần thành lập. Từ năm 1371, Hồ Quý Ly, khi đó mang họ Lê, được tham gia triều chính nhà Trần, được vua Trần Dụ Tôn",
  "Nhã Lang": "Nhã Lang Vương tên thật Lý Nhã Lang là hoàng tử của hậu Lý Nam Đế Lý Phật Tử. Vì là con trai thứ 8 của vua nên Nhã Lang còn được gọi là Lý Bát Lang. Lý Nhã Lang là con trai của Lý Phật Tử và bà Lã Ngọc Thành (quê làng Chu Chàng, Quảng Oai, Sơn Tây).\nNhã Lang Vương được xem là một vị Thần lớn của Việt Nam, được thờ cúng rộng rãi và làm thành hoàng ở rất nhiều địa phương Miền Bắc.\n\nTruyền Thuyết\nLý Nam Đế sau khi đại bại với quân xâm lược nhà Lương thì giao việc nước cho Triệu Quang Phục, Quang Ph",
  "Nhà Trần": "Nhà Trần (chữ Nôm: 茹陳, chữ Hán: 陳朝, Hán Việt: Trần triều) là một triều đại quân chủ cai trị nước Đại Việt từ năm 1226 đến năm 1400. Đây là triều đại được lưu danh với những chiến công hiển hách trong lịch sử Việt Nam. Triều đại này khởi đầu khi Trần Cảnh lên ngôi vào năm 1226 sau khi được vợ là Lý Chiêu Hoàng truyền ngôi. Những năm đầu tiên, Trần Cảnh còn nhỏ tuổi, toàn bộ quyền hành của nhà Trần đều do một tông thất vai chú của Trần Cảnh là Trần Thủ Độ nắm quyền, chính Trần Thủ Độ đã âm thầm ép",
  "Niên hiệu Việt Nam": "Chịu ảnh hưởng của Trung Quốc, các triều đại Việt Nam cũng đặt niên hiệu (chữ Hán: 年號) khi các vua xưng hoàng đế.\nDưới đây là bảng kê các niên hiệu của vua Việt Nam qua các đời.\n\nNiên hiệu các triều vua, chúa Việt Nam\nThống kê\nCác triều đại phong kiến Việt Nam có tất cả 144 niên hiệu.\nBảng trên đây chưa bao gồm những niên hiệu của các lực lượng nổi dậy nhanh chóng bị trấn áp và không thành lập được một triều đại, như niên hiệu Thiên Ứng của Trần Cảo thời Lê Sơ.\nNiên hiệu đầu tiên trong lịch sử V",
  "Phiên Ngung (kinh đô)": "Phiên Ngung (chữ Hán: 蕃隅) hay Phiên Ngu (chữ Hán: 蕃禺/番禺), đọc theo âm cổ là Paungoo hoặc P'angu, là kinh đô của nước Nam Việt thời nhà Triệu vào thế kỷ 2-3 TCN và của nước Nam Hán vào thế kỷ 10, nay là thành phố Quảng Châu, tỉnh Quảng Đông, Trung Quốc.\n\nLịch sử\nThời cổ, vùng đất Phiên Ngung còn có những tên gọi khác như Sử Sở đình (tức trung tâm quyền lực của nước Sở), Dương thành (tức thành phố con dê). Nguyên do từ truyện thần thoại có 5 thần nhân mặc y phục ngũ sắc mỗi vị một màu, cưỡi trên n",
  "Phong trào Nhân Văn – Giai Phẩm": "Phong trào Nhân Văn – Giai Phẩm là một phong trào văn hóa mang xu hướng chính trị của một số văn nghệ sĩ, trí thức sống ở miền Bắc dưới chính quyền Việt Nam Dân chủ Cộng hòa, khởi xướng từ đầu năm 1955 và kết thúc vào tháng 6 năm 1958.\nPhong trào này tuyên bố mục tiêu là đòi quyền tự do thể hiện quan điểm chính trị cho giới nghệ sĩ. Tuy nhiên, Nhà nước Việt Nam Dân chủ Cộng hòa cho rằng phong trào đã lợi dụng việc sáng tác văn nghệ để tuyên truyền chống phá Nhà nước, khởi nguồn từ một nhóm trí t",
  "Phủ (đơn vị hành chính)": "Phủ (chữ Hán: 府) là một đơn vị hành chính thời phong kiến tại Đông Á bắt nguồn từ Trung Quốc thời Nhà Đường.\nTại Việt Nam, phủ là đơn vị hành chính trực thuộc trấn (thời Trần) hoặc tỉnh (thời Nguyễn), mỗi phủ gồm một số huyện. Đến cuối thời Nguyễn, dưới phủ có thể không có huyện mà chỉ có xã, thôn (khi đó, phủ tương đương cấp huyện nhưng có vị trí quan trọng hơn).\nPhủ cũng là một đợn vị hành chính của Nhật Bản như hai phủ Osaka và Kyoto. Ở Nhật Bản, phủ là một đơn vị hành chính tương đương cấp t",
  "Phụ nữ ở Việt Nam": "Phụ nữ Việt Nam là nguồn nhân tố quan trọng đối với sự phát triển toàn diện của xã hội Việt Nam. Lịch sử đã và luôn minh chứng sự hiện diện của phu nữ trong các vai trò quan trọng của xã hội. Quá trình xây dựng, lao động sản xuất, đấu tranh chống thiên tai, địch họa, tề gia... Được khẳng định qua năng lực và phẩm hạnh trong các hoạt động xã hội, bao gồm cả trong lĩnh vực phi truyền thống nhất, góp một phần to lớn công sức và trí tuệ cho nền hoà bình và văn minh nhân loại.\nChiếm 51% lực lượng lao",
  "Phục hồi triều đại trong lịch sử Việt Nam": "Phục hồi triều đại trong lịch sử Việt Nam là các phong trào nhằm khôi phục lại một triều đại đã sụp đổ từ các lực lượng chính trị trung thành diễn ra trong lịch sử Việt Nam. Các phong trào này không chấp nhận triều đại mới, không thừa nhận tính chính thống và thường gán ghép triều đại mới là ngụy triều. Việc chống lại triều đại mới để phục hồi triều đại cũ dẫn đến những cuộc nội chiến dữ dội trong lịch sử Việt Nam. Một số nỗ lực trong đó đã lôi kéo quân đội nước ngoài vào và một số trong đó đã d",
  "Quá trình mở rộng lãnh thổ của Việt Nam": "Quá trình mở rộng lãnh thổ của Việt Nam bắt đầu từ khoảng thế kỷ 11 đến thế kỷ 19, dân tộc Việt đã mở mang lãnh thổ ra hướng tây, hướng nam và mở rộng chủ quyền trên biển Đông. Phần quan trọng nhất của quá trình này là nam tiến, hướng bành trướng xuống phía nam. Lãnh thổ do người Việt quản lý đạt mức rộng lớn nhất dưới thời nhà Nguyễn. Quá trình mở rộng lãnh thổ của Việt Nam diễn ra trên đất liền lẫn trên biển, trải qua gần một nghìn năm, chịu lực cản rất lớn từ các nước láng giềng. Quá trình mở",
  "Quảng Châu (địa danh cổ)": "Quảng Châu (chữ Hán: 廣州) là tên một châu thời cổ, bao trùm phần lớn khu vực Lưỡng Quảng tức hai tỉnh Quảng Đông, Quảng Tây thuộc Trung Quốc ngày nay.\n\nBối cảnh lịch sử\nNăm 203, bộ Giao Chỉ (kế thừa lãnh thổ nước Nam Việt xưa cộng thêm đảo Hải Nam và phần đất phía nam dãy núi Hoành Sơn) được vua Hiến Đế nhà Đông Hán đổi tên thành Giao Châu trên cơ sở đề nghị của Sĩ Nhiếp, thái thú quận Giao Chỉ và Trương Tân, thứ sử bộ Giao Chỉ. Khi đó Giao Châu là một cấp hành chính (châu), gồm 9 quận là: Giao C",
  "Quảng Tín (huyện)": "Quảng Tín (chữ Hán: 廣信) là một huyện lập ra thời Bắc thuộc (đời Hán Vũ Đế nhà Tây Hán), phân chia ranh giới hai tỉnh Quảng Đông và Quảng Tây thuộc Trung Quốc ngày nay.\nHuyện Quảng Tín là trị sở quận Thương Ngô thời Tây Hán và Đông Hán (tức quận Tân Quảng 新廣 thời nhà Tân) và là châu trị của bộ Giao Chỉ (hay Giao Châu) từ năm 106 TCN cho đến khi Phiên Ngung được chọn làm trị sở Giao Châu vào năm 210.\nĐịa bàn của huyện nay là thành phố Ngô Châu thuộc Quảng Tây hoặc huyện Phong Khai thuộc địa cấp th",
  "Rùa thần Kim Quy": "Rùa thần Kim Quy (金龜) hay Rùa vàng, còn gọi là Thanh Giang sứ giả (清江使者), theo truyền thuyết là sinh vật thần thánh đã giúp An Dương Vương xây thành Cổ Loa và cải tiến nỏ thần.\n\nTruyền thuyết\nAn Dương Vương xây thành Cổ Loa mấy lần không được. Thành xây xong thì chỉ một thời gian ngắn là bị đổ. Sau nhiều lần xây An Dương Vương quyết định lập đàn tế lễ bên bờ sông. Một vị thần hiện ra cho biết sứ giả Thanh Giang sẽ đến giúp. Một thời gian sau một con rùa nổi lên, xưng là sứ giả của thần Thanh Gia",
  "Chiến tranh Việt – Xiêm (1771–1773)": "Chiến tranh Xiêm - Việt (1771–1773) là một cuộc chiến giữa Vương triều Thonburi nước Xiêm La (Thái Lan ngày nay) dưới thời Vua Taksin và triều đình Chúa Nguyễn ở Đàng Trong nước Đại Việt (Việt Nam ngày nay). Cuộc chiến này cũng có liên quan đến Vương quốc Cao Miên và Hà Tiên trấn, đồng minh cũng như chư hầu của Chúa Nguyễn.\n\nBối cảnh\nNăm 1671, trước cảnh nhà Minh ở Trung Quốc diệt vong, một người Quảng Đông tên là Mạc Cửu (鄚玖) đã giong buồn từ Lôi Châu, Quảng Đông đến định cư ở đất Bantaey Meas ",
  "Tên gọi của Thành phố Hồ Chí Minh": "Thành phố mà ngày nay được gọi là Thành phố Hồ Chí Minh () đã được gọi bằng một số tên khác nhau xuyên suốt lịch sử của nó, phản ánh sự định cư của các nhóm dân tộc, văn hóa, và chính trị khác nhau. Ban đầu được gọi là Prey Nôkôr khi còn là một phần của Đế quốc Khmer, nó được những người  Việt định cư chạy trốn Chiến tranh Trịnh–Nguyễn ở phía bắc mệnh danh một cách không chính thức là Sài Gòn (). Sau này, người Việt kiểm soát thành phố và các khu vực xung quanh, và đã đặt tên cho thành phố là Gi",
  "Tên gọi Việt Nam": "Việt Nam qua các thời kỳ, triều đại nhà nước khác nhau với những tên gọi hoặc quốc hiệu khác nhau. Bên cạnh đó, cũng có những danh xưng chính thức hoặc không chính thức để chỉ một vùng lãnh thổ thuộc Việt Nam.\n\nTổng quát\nTên gọi của các nhà nước/triều đại\nDưới đây là danh sách tên gọi các nhà nước/triều đại từng tồn tại ở Việt Nam theo dòng lịch sử. Các quốc hiệu này đều được ghi chép trong các sách sử Việt Nam, hoặc được chính thức sử dụng trong nghi thức ngoại giao quốc tế.\n\nVăn Lang\nVăn Lang ",
  "Thái sư": "Thái sư (太師) là chức quan đứng đầu trong \"Tam thái\", bao gồm: Thái sư, Thái phó (太傅), Thái bảo (太保). Đây là chức quan tuy không đứng đầu triều trong chế độ phong kiến nhưng phẩm trật còn cao hơn cả chức vụ tể tướng, tuy nhiên, không phải triều đại nào cũng đặt ra chức thái sư và chức thái sư ít khi có quyền lực thực tế. Trong lịch sử Việt Nam có một vị thái sư nổi tiếng là Thái sư Trần Thủ Độ, người có vai trò quan trọng trong việc đảo chính lật đổ nhà Lý và lập nên nhà Trần. Thái sư còn là chức",
  "Thái thượng hoàng": "Thái thượng hoàng (chữ Hán: 太上皇), cũng gọi Thái thượng hoàng đế (太上皇帝), giản xưng Thượng Hoàng (上皇), là một tước vị mang ý nghĩa là \"Hoàng đế bề trên\", địa vị cơ bản được xem là trên danh vị Hoàng đế.\nDanh hiệu này có từ thời nhà Hán, thường chỉ được dùng cho người là cha của Hoàng đế nhưng chưa từng là Hoàng đế. Về sau, các Hoàng đế khi thoái vị cũng được dâng tôn danh hiệu này. Nếu người được tôn vấn còn sống, thì sẽ là [\"Thái thượng hoàng\"'] hoặc [\"Thái thượng hoàng đế\"] kèm theo tôn hiệu khá",
  "Thành Cổ Loa": "Thành Cổ Loa là kinh đô của nhà nước Âu Lạc dưới thời An Dương Vương vào khoảng thế kỷ thứ 3 trước Công nguyên và của nhà nước phong kiến dưới thời Ngô Quyền thế kỷ 10 tại vùng đất xã Cổ Loa, huyện Đông Anh, Hà Nội.\n\nBối cảnh địa lý\nVào thời Âu Lạc, Cổ Loa nằm vào vị trí đỉnh của tam giác châu thổ sông Hồng và là nơi giao lưu quan trọng của đường thủy và đường bộ. Từ đây có thể kiểm soát được cả vùng đồng bằng lẫn vùng sơn địa. Cổ Loa là một khu đất đồi cao ráo nằm ở tả ngạn sông Hoàng. Con sông",
  "Thiện nhượng": "Thiện nhượng (chữ Hán: 禪讓) có nghĩa là nhường lại ngôi vị, được ghép bởi các cụm từ Thiện vị và Nhượng vị, là một phương thức thay đổi quyền thống trị của những triều đại trong lịch sử Trung Quốc.\n\nNguồn gốc\nThời tiền sử, khi sản xuất còn lạc hậu, xã hội nguyên thủy phổ biến ở các bộ lạc bởi khả năng có thể tập hợp nhân lực trong sản xuất cũng như chống lại các tai họa đến từ thiên nhiên, muông thú và thậm chí cả con người (cụ thể là các liên minh bộ lạc khác). Xuất phát bởi nhu cầu thực tế đó, ",
  "Thổ ty": "Thổ ty (土司) là quan lại xưa cha truyền con nối ở miền dân tộc thiểu số.\n\nThổ ty Trung Quốc\nThổ ty Bá Châu\nThổ ty Lệ Giang\nThổ ty Vĩnh Ninh\nThổ ty Diêu An\nThổ ty Hạc Khánh\nThổ ty Chuchen (Thổ ty Đại Kim Xuyên)\nThổ ty Tsanlha (Thổ ty Tiểu Kim Xuyên)\nThổ ty Bathang (Thổ ty Ba Đường)\nThổ ty Lithang (Thổ ty Lý Đường)\nThổ ty Béri (Thổ ty Bạch Lợi)\nThổ ty Muli (Thổ ty Mộc Lý)\nVương quốc Chakla (Thổ ty Minh Chính)\nVương quốc Derge (Thổ ty Đức Cách)\nVương quốc Powo (Thổ vương Bomê)\n\nThổ ty Việt Nam\nThổ t",
  "Thời kỳ Bắc thuộc lần thứ nhất": "Bắc thuộc lần thứ nhất (chữ Nôm: 北屬吝次一, ngắn gọn: Bắc thuộc lần 1) trong lịch sử Việt Nam là thời kỳ đầu tiên Việt Nam nằm dưới sự cai trị của của nền phong kiến Trung Quốc.\n\nLịch sử\nThời điểm bắt đầu\nDấu mốc xác định thời kỳ đầu tiên này chưa thống nhất giữa các tài liệu, do quan niệm khác nhau về nước Nam Việt và nhà Triệu.\n\nQuan điểm công nhận nhà Triệu là triều đại của Việt Nam (Đại Việt sử ký toàn thư, Khâm định Việt sử thông giám cương mục, Việt Nam sử lược) xác định rằng khi nhà Triệu bị ",
  "Thủ đô Việt Nam": "Thủ đô Việt Nam hiện nay là thành phố Hà Nội. Sau đây là danh sách các kinh đô/thủ đô – hiểu theo nghĩa rộng – là các trung tâm chính trị của chính thể nhà nước trong lịch sử Việt Nam, và cả của các vương quốc cổ/cựu quốc gia từng tồn tại trên lãnh thổ Việt Nam ngày nay.\n\nKinh đô và Thủ đô của Việt Nam qua các thời kỳ\nPhần này liệt kê các kinh đô/thủ đô trong lịch sử Việt Nam, theo trình tự thời gian. Các kinh đô được in đậm là các kinh đô độc lập của Việt Nam, còn các kinh đô được in nghiêng là",
  "Thuyền nhân Việt Nam": "Thuyền nhân Việt Nam là hiện tượng gần một triệu người, vượt biên khỏi Việt Nam bằng đường biển bắt đầu sau khi chính phủ Việt Nam Cộng hòa đầu hàng Chính phủ Cách mạng lâm thời Cộng hòa miền Nam Việt Nam, diễn ra cao điểm vào năm 1978–1979 (năm diễn ra chiến tranh biên giới Tây Nam và chiến tranh biên giới Việt – Trung) và tiếp diễn cho đến giữa thập niên 1980. Đến năm 1999, vẫn còn một số người Việt vượt biển đến Hồng Kông với hy vọng tìm kiếm thu nhập cao hơn, trong khi nhiều trại tị nạn ở Đô",
  "Thương cảng Vân Đồn": "Thương cảng Vân Đồn từng là một thương cảng của nước Đại Việt, tồn tại từ giữa thế kỷ 12 đến cuối thế kỷ 18 ở vùng biển nay thuộc tỉnh Quảng Ninh, Việt Nam. Đây là trung tâm giao thương lớn và quan trọng của Việt Nam lúc bấy giờ với nhiều thuyền buôn từ khắp châu Á và châu Âu đến buôn bán, trao đổi hàng hóa.\n\nVị trí\nHiện nay vẫn còn nhiều ý kiến khác nhau về phạm vi của thương cảng, tuy nhiên các nhà sử học đều có chung nhận định rằng thương cảng Vân Đồn không bao gồm một bến cảng mà là hệ thống",
  "Tranh chấp đất đai tại Đồng Tâm": "Tranh chấp đất đai tại Đồng Tâm, được biết đến trên các phương tiện thông tin đại chúng từ năm 2017 là vụ việc tranh chấp đất đai giữa một số người và chính phủ Việt Nam. Vụ việc gồm 2 sự kiện là \"bắt giữ con tin\" (gồm công an, nhà báo và cán bộ chính quyền) năm 2017 và \"trấn áp bạo lực\" năm 2020.\nThảo luận giữa người dân và chính quyền tiếp tục duy trì từ 2017 đến 2019, nhưng không có kết quả. Vào lúc 3 giờ rạng sáng ngày 9 tháng 1 năm 2020, hai bên đã xảy ra đụng độ.\nTheo Bộ Công an Việt Nam t",
  "Trận hạ thành Quy Nhơn": "Trận hạ thành Quy Nhơn là trận chiến giữa quân đội chúa Nguyễn và quân đội Tây Sơn năm [] nhằm giành quyền kiểm soát thành Hoàng Đế và phủ Quy Nhơn. Trận chiến kết thúc với thắng lợi của quân đội chúa Nguyễn giành được quyền kiểm soát Quy Nhơn và đổi tên thành Hoàng Đế thành Bình Định. Tất cả quân đội Tây Sơn bị bao vây trong thành phải ra hàng chúa Nguyễn. Trận chiến là một mốc quan trọng đánh dấu sự đổi triều trong chiến tranh giữa chúa Nguyễn và Tây Sơn.\n\nNguyên nhân dẫn đến trận chiến\nSau kh",
  "Trận Hòa Mộc": "Trận Hòa Mộc ngày 2 tháng 3 năm 1885 là một trận giao tranh quyết liệt trong cuộc chiến Pháp-Thanh (8/ 1884 đến 4/1885). Trong trận này lữ đoàn I do Đại tá Giovanninelli chỉ huy thuộc Quân đoàn viễn chinh Bắc Kỳ đã chiến thắng quân Cờ Đen và quân đội nhà Thanh đang vây hãm thành Tuyên Quang.\n\nBối cảnh\n\nHòa Mộc là một địa điểm bên bờ sông Lô cách thành Tuyên Quang vài dặm đường về phía đông nam. Ngày 13 Tháng Hai năm 1885, sau khi hạ được thành Lạng Sơn, buộc quân Thanh phải rút về Quảng Tây thì ",
  "Trọng Thủy": "Trọng Thủy (chữ Hán: 仲始), tên đầy đủ là Triệu Trọng Thủy  (chữ Hán: 趙仲始), là hoàng tử nước Nam Việt, con trai của Triệu Đà đồng thời là hôn phu của Mỵ Châu Công chúa phò mã nước Âu Lạc.\n\nCon rể Âu Lạc\nTheo Đại Việt sử ký toàn thư và Khâm định Việt sử thông giám cương mục, sau nhiều lần giao tranh với An Dương Vương không thắng được, Triệu Đà sai Trọng Thủy sang nước Âu Lạc, hầu trong cung An Dương Vương làm túc vệ, rồi cầu hôn công chúa Mỵ Châu. An Dương Vương bằng lòng, cho Trọng Thủy lấy con g"
}